#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: ba116f144d1496acd7c54346b830e3af.pdb
; shader hash: ba116f144d1496acd7c54346b830e3af
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB1
; {
;
;   struct CB1
;   {
;
;       float4 gInvThicknessTable[3];                 ; Offset:    0
;       float4 gSampleWeightTable[3];                 ; Offset:   48
;       float2 gInvSliceDimension;                    ; Offset:   96
;       float gRejectFadeoff;                         ; Offset:  104
;       float gRcpAccentuation;                       ; Offset:  108
;   
;   } CB1;                                            ; Offset:    0 Size:   112
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CB1                               cbuffer      NA          NA     CB0            cb1     1
; LinearBorderSampler               sampler      NA          NA      S0             s1     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !50)
!1 = !DIFile(filename: "Shaders\5CAoRender1CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !23}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 113, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 113, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 113, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 113, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 118, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 118, size: 96, align: 32, elements: !15, templateParams: !20)
!15 = !{!16, !18, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !14, file: !1, line: 118, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !14, file: !1, line: 118, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !14, file: !1, line: 118, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!21, !22}
!21 = !DITemplateTypeParameter(name: "element", type: !17)
!22 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 167, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 167, size: 64, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 167, baseType: !27, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 167, baseType: !27, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!30, !12}
!30 = !DITemplateTypeParameter(name: "element", type: !27)
!31 = !{!32, !44, !47}
!32 = !DISubprogram(name: "main", scope: !33, file: !33, line: 108, type: !34, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DIFile(filename: "Shaders/AoRenderCS.hlsli", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{null, !36, !43, !36, !36}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 48, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 48, size: 96, align: 32, elements: !38, templateParams: !42)
!38 = !{!39, !40, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, line: 48, baseType: !27, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, line: 48, baseType: !27, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !37, file: !1, line: 48, baseType: !27, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!30, !22}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 48, baseType: !27)
!44 = !DISubprogram(name: "TestSamples", linkageName: "\01?TestSamples@@YAMIIIMM@Z", scope: !33, file: !33, line: 67, type: !45, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!17, !43, !43, !43, !17, !17}
!47 = !DISubprogram(name: "TestSamplePair", linkageName: "\01?TestSamplePair@@YAMMMIH@Z", scope: !33, file: !33, line: 50, type: !48, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!17, !17, !17, !43, !8}
!50 = !{!51, !65, !66, !74, !76, !77, !81, !84, !86}
!51 = !DIGlobalVariable(name: "gInvThicknessTable", linkageName: "\01?gInvThicknessTable@CB1@@3QBV?$vector@M$03@@B", scope: !0, file: !33, line: 29, type: !52, isLocal: false, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 384, align: 32, elements: !63)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 29, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 29, size: 128, align: 32, elements: !56, templateParams: !61)
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !55, file: !1, line: 29, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !55, file: !1, line: 29, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !55, file: !1, line: 29, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !55, file: !1, line: 29, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!61 = !{!21, !62}
!62 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIGlobalVariable(name: "gSampleWeightTable", linkageName: "\01?gSampleWeightTable@CB1@@3QBV?$vector@M$03@@B", scope: !0, file: !33, line: 30, type: !52, isLocal: false, isDefinition: true)
!66 = !DIGlobalVariable(name: "gInvSliceDimension", linkageName: "\01?gInvSliceDimension@CB1@@3V?$vector@M$01@@B", scope: !0, file: !33, line: 31, type: !67, isLocal: false, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 31, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !70, templateParams: !73)
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !69, file: !1, line: 31, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !69, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!73 = !{!21, !12}
!74 = !DIGlobalVariable(name: "gRejectFadeoff", linkageName: "\01?gRejectFadeoff@CB1@@3MB", scope: !0, file: !33, line: 32, type: !75, isLocal: false, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!76 = !DIGlobalVariable(name: "gRcpAccentuation", linkageName: "\01?gRcpAccentuation@CB1@@3MB", scope: !0, file: !33, line: 33, type: !75, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "DepthSamples", linkageName: "\01?DepthSamples@@3PAMA", scope: !0, file: !33, line: 48, type: !78, isLocal: false, isDefinition: true, variable: [256 x float] addrspace(3)* @"\01?DepthSamples@@3PAMA")
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8192, align: 32, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 256)
!81 = !DIGlobalVariable(name: "DepthTex", linkageName: "\01?DepthTex@@3V?$Texture2DArray@M@@A", scope: !0, file: !33, line: 21, type: !82, isLocal: false, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2DArray<float>", file: !1, line: 21, size: 64, align: 32, elements: !2, templateParams: !83)
!83 = !{!21}
!84 = !DIGlobalVariable(name: "Occlusion", linkageName: "\01?Occlusion@@3V?$RWTexture2D@M@@A", scope: !0, file: !33, line: 25, type: !85, isLocal: false, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !83)
!86 = !DIGlobalVariable(name: "LinearBorderSampler", linkageName: "\01?LinearBorderSampler@@3USamplerState@@A", scope: !0, file: !33, line: 26, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 26, size: 32, align: 32, elements: !2)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!91 = !{!"Shaders\5CAoRender1CS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#define INTERLEAVE_RESULT\0D\0A#include \22AoRenderCS.hlsli\22\0D\0A"}
