#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TexCoord                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: 29745abe4561d03d30d2fadcb9a26a32.pdb
; shader hash: 29745abe4561d03d30d2fadcb9a26a32
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer Constants
; {
;
;   struct Constants
;   {
;
;       uint2 TextureSize;                            ; Offset:    0
;       float A;                                      ; Offset:    8
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !32, globals: !77)
!1 = !DIFile(filename: "Shaders\5CBicubicUpsampleGammaPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 68, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 68, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 68, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 31, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 31, size: 128, align: 32, elements: !15, templateParams: !21)
!15 = !{!16, !18, !19, !20}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !14, file: !1, line: 31, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !14, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !14, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !14, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !17)
!23 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 30, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 30, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 30, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!31, !12}
!31 = !DITemplateTypeParameter(name: "element", type: !28)
!32 = !{!33, !51, !54, !57, !58, !61, !65, !69, !73, !74, !75, !76}
!33 = !DISubprogram(name: "main", scope: !34, file: !34, line: 64, type: !35, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!34 = !DIFile(filename: "Shaders/BicubicUpsamplePS.hlsl", directory: "")
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !13, !45}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 31, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 31, size: 96, align: 32, elements: !39, templateParams: !43)
!39 = !{!40, !41, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, line: 31, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !{!22, !44}
!44 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 31, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !47, templateParams: !50)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !46, file: !1, line: 31, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !46, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!50 = !{!22, !12}
!51 = !DISubprogram(name: "GetWeights", linkageName: "\01?GetWeights@@YA?AV?$vector@M$03@@M@Z", scope: !34, file: !34, line: 44, type: !52, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!13, !17}
!54 = !DISubprogram(name: "W2", linkageName: "\01?W2@@YAMM@Z", scope: !34, file: !34, line: 39, type: !55, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!17, !17}
!57 = !DISubprogram(name: "W1", linkageName: "\01?W1@@YAMM@Z", scope: !34, file: !34, line: 34, type: !55, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubprogram(name: "Cubic", linkageName: "\01?Cubic@@YA?AV?$vector@M$02@@V?$vector@M$03@@V1@111@Z", scope: !34, file: !34, line: 49, type: !59, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!37, !13, !37, !37, !37, !37}
!61 = !DISubprogram(name: "GetColor", linkageName: "\01?GetColor@@YA?AV?$vector@M$02@@II@Z", scope: !34, file: !34, line: 54, type: !62, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!37, !64, !64}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 70, baseType: !28)
!65 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !66, file: !66, line: 94, type: !67, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!67 = !DISubroutineType(types: !68)
!68 = !{!37, !37, !8}
!69 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !70, file: !70, line: 37, type: !71, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!71 = !DISubroutineType(types: !72)
!72 = !{!37, !37}
!73 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !66, file: !66, line: 71, type: !71, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !70, file: !70, line: 63, type: !71, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !70, file: !70, line: 75, type: !71, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !70, file: !70, line: 120, type: !71, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!77 = !{!78, !80, !82, !86, !88}
!78 = !DIGlobalVariable(name: "TextureSize", linkageName: "\01?TextureSize@Constants@@3V?$vector@I$01@@B", scope: !0, file: !34, line: 30, type: !79, isLocal: false, isDefinition: true)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!80 = !DIGlobalVariable(name: "A", linkageName: "\01?A@Constants@@3MB", scope: !0, file: !34, line: 31, type: !81, isLocal: false, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!82 = !DIGlobalVariable(name: "ColorTex", linkageName: "\01?ColorTex@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !34, line: 25, type: !83, isLocal: false, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 25, size: 128, align: 32, elements: !2, templateParams: !84)
!84 = !{!85}
!85 = !DITemplateTypeParameter(name: "element", type: !38)
!86 = !DIGlobalVariable(name: "BilinearClamp", linkageName: "\01?BilinearClamp@@3USamplerState@@A", scope: !0, file: !34, line: 26, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 26, size: 32, align: 32, elements: !2)
!88 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !76, file: !70, line: 122, type: !89, isLocal: false, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 122, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 122, size: 288, align: 32, elements: !92, templateParams: !102)
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !91, file: !1, line: 122, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !91, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !91, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !91, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !91, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !91, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !91, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !91, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !91, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!102 = !{!22, !103, !104}
!103 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 3)
!104 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 3)
!105 = !{i32 2, !"Dwarf Version", i32 4}
!106 = !{i32 2, !"Debug Info Version", i32 3}
!107 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!108 = !{!"Shaders\5CBicubicUpsampleGammaPS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#define GAMMA_SPACE\0D\0A#include \22BicubicUpsamplePS.hlsl\22\0D\0A"}
