#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 8f3ca27261193c5aa7720e1102a3e9d8.pdb
; shader hash: 8f3ca27261193c5aa7720e1102a3e9d8
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float2 kRcpScale;                             ; Offset:    0
;       float kA;                                     ; Offset:    8
;   
;   } CB0;                                            ; Offset:    0 Size:    12
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CB0                               cbuffer      NA          NA     CB0            cb0     1
; Source                            texture     f32          2d      T0             t0     1
; Dest                                  UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%dx.types.Handle = type { i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !57, globals: !109)
!1 = !DIFile(filename: "Shaders\5CBicubicUpsampleCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !29, !30, !39}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 23, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 23, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 78, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 78, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 78, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 78, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 81, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 81, size: 64, align: 32, elements: !24, templateParams: !27)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 81, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 81, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !{!28, !12}
!28 = !DITemplateTypeParameter(name: "element", type: !13)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 49, baseType: !18)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 104, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 104, size: 128, align: 32, elements: !32, templateParams: !37)
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 104, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !31, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!37 = !{!11, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x4", file: !1, line: 17, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 4>", file: !1, line: 17, size: 384, align: 32, elements: !41, templateParams: !54)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !40, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!54 = !{!11, !55, !56}
!55 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!56 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!57 = !{!58, !69, !79, !83, !84, !87, !88, !91, !95, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!58 = !DISubprogram(name: "main", scope: !1, file: !1, line: 71, type: !59, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !61, !61, !61, !29}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 49, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 49, size: 96, align: 32, elements: !63, templateParams: !67)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !62, file: !1, line: 49, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !62, file: !1, line: 49, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !62, file: !1, line: 49, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!67 = !{!21, !68}
!68 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!69 = !DISubprogram(name: "StoreLDS", linkageName: "\01?StoreLDS@@YAXIV?$vector@M$02@@@Z", scope: !1, file: !1, line: 52, type: !70, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !29, !72}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 129, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 129, size: 96, align: 32, elements: !74, templateParams: !78)
!74 = !{!75, !76, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !73, file: !1, line: 129, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !73, file: !1, line: 129, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !73, file: !1, line: 129, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!78 = !{!11, !68}
!79 = !DISubprogram(name: "GetBicubicFilterWeights", linkageName: "\01?GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z", scope: !80, file: !80, line: 29, type: !81, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DIFile(filename: "Shaders/BicubicFilterFunctions.hlsli", directory: "")
!81 = !DISubroutineType(types: !82)
!82 = !{!30, !8, !8}
!83 = !DISubprogram(name: "ComputeWeights", linkageName: "\01?ComputeWeights@@YA?AV?$vector@M$03@@MM@Z", scope: !80, file: !80, line: 24, type: !81, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubprogram(name: "W2", linkageName: "\01?W2@@YAMMM@Z", scope: !80, file: !80, line: 19, type: !85, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!8, !8, !8}
!87 = !DISubprogram(name: "W1", linkageName: "\01?W1@@YAMMM@Z", scope: !80, file: !80, line: 14, type: !85, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubprogram(name: "LoadSamples", linkageName: "\01?LoadSamples@@YA?AV?$matrix@M$02$03@@II@Z", scope: !1, file: !1, line: 60, type: !89, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{!39, !29, !29}
!91 = !DISubprogram(name: "RemoveDisplayProfile", linkageName: "\01?RemoveDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !92, file: !92, line: 114, type: !93, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!93 = !DISubroutineType(types: !94)
!94 = !{!72, !72, !13}
!95 = !DISubprogram(name: "RemoveSRGBCurve", linkageName: "\01?RemoveSRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !96, file: !96, line: 43, type: !97, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!96 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!97 = !DISubroutineType(types: !98)
!98 = !{!72, !72}
!99 = !DISubprogram(name: "RGBLimitedToFull10bit", linkageName: "\01?RGBLimitedToFull10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !92, file: !92, line: 76, type: !97, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubprogram(name: "RemoveREC709Curve", linkageName: "\01?RemoveREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !96, file: !96, line: 68, type: !97, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!101 = !DISubprogram(name: "REC2020toREC709", linkageName: "\01?REC2020toREC709@@YA?AV?$vector@M$02@@V1@@Z", scope: !96, file: !96, line: 131, type: !97, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!102 = !DISubprogram(name: "RemoveREC2084Curve", linkageName: "\01?RemoveREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !96, file: !96, line: 86, type: !97, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !92, file: !92, line: 94, type: !93, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !96, file: !96, line: 37, type: !97, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!105 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !92, file: !92, line: 71, type: !97, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!106 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !96, file: !96, line: 63, type: !97, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !96, file: !96, line: 75, type: !97, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!108 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !96, file: !96, line: 120, type: !97, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!109 = !{!110, !112, !114, !118, !119, !120, !124, !126, !131, !133, !135, !137, !139, !155}
!110 = !DIGlobalVariable(name: "kRcpScale", linkageName: "\01?kRcpScale@CB0@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 23, type: !111, isLocal: false, isDefinition: true)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!112 = !DIGlobalVariable(name: "kA", linkageName: "\01?kA@CB0@@3MB", scope: !0, file: !1, line: 24, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!114 = !DIGlobalVariable(name: "g_R", linkageName: "\01?g_R@@3PAMA", scope: !0, file: !1, line: 47, type: !115, isLocal: false, isDefinition: true, variable: [361 x float] addrspace(3)* @"\01?g_R@@3PAMA")
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 11552, align: 32, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 361)
!118 = !DIGlobalVariable(name: "g_G", linkageName: "\01?g_G@@3PAMA", scope: !0, file: !1, line: 48, type: !115, isLocal: false, isDefinition: true, variable: [361 x float] addrspace(3)* @"\01?g_G@@3PAMA")
!119 = !DIGlobalVariable(name: "g_B", linkageName: "\01?g_B@@3PAMA", scope: !0, file: !1, line: 49, type: !115, isLocal: false, isDefinition: true, variable: [361 x float] addrspace(3)* @"\01?g_B@@3PAMA")
!120 = !DIGlobalVariable(name: "Source", linkageName: "\01?Source@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 18, type: !121, isLocal: false, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 18, size: 128, align: 32, elements: !2, templateParams: !122)
!122 = !{!123}
!123 = !DITemplateTypeParameter(name: "element", type: !73)
!124 = !DIGlobalVariable(name: "Dest", linkageName: "\01?Dest@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 19, type: !125, isLocal: false, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 3> >", file: !1, line: 19, size: 96, align: 32, elements: !2, templateParams: !122)
!126 = !DIGlobalVariable(name: "FilterWeights", scope: !79, file: !80, line: 34, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 2048, align: 32, elements: !129)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!129 = !{!130}
!130 = !DISubrange(count: 16)
!131 = !DIGlobalVariable(name: "FilterWeights.0", linkageName: "\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.0", scope: !79, file: !80, line: 34, type: !132, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.0")
!132 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !127, size: 512, align: 4)
!133 = !DIGlobalVariable(name: "FilterWeights.1", linkageName: "\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.1", scope: !79, file: !80, line: 34, type: !134, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.1")
!134 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !127, size: 512, align: 4, offset: 512)
!135 = !DIGlobalVariable(name: "FilterWeights.2", linkageName: "\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.2", scope: !79, file: !80, line: 34, type: !136, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.2")
!136 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !127, size: 512, align: 4, offset: 1024)
!137 = !DIGlobalVariable(name: "FilterWeights.3", linkageName: "\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.3", scope: !79, file: !80, line: 34, type: !138, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.3")
!138 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !127, size: 512, align: 4, offset: 1536)
!139 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC2020toREC709@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !101, file: !96, line: 133, type: !140, isLocal: false, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 133, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 133, size: 288, align: 32, elements: !143, templateParams: !153)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !142, file: !1, line: 133, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !142, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !142, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !142, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !142, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !142, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !142, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !142, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !142, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!153 = !{!11, !55, !154}
!154 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!155 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !108, file: !96, line: 122, type: !140, isLocal: false, isDefinition: true)
!156 = !{i32 2, !"Dwarf Version", i32 4}
!157 = !{i32 2, !"Debug Info Version", i32 3}
!158 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
