#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TexCoord                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: 341d7bb0ffb11a4b697dfda1455e633c.pdb
; shader hash: 341d7bb0ffb11a4b697dfda1455e633c
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !52)
!1 = !DIFile(filename: "Shaders\5CBilinearUpsamplePS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !34, !38, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 21, type: !5, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !18, !27}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !9, templateParams: !14)
!9 = !{!10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !{!15, !16}
!15 = !DITemplateTypeParameter(name: "element", type: !11)
!16 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 3)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !20, templateParams: !25)
!20 = !{!21, !22, !23, !24}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !19, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !19, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !19, file: !1, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !19, file: !1, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!25 = !{!15, !26}
!26 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 4)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !29, templateParams: !32)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !{!15, !33}
!33 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 2)
!34 = !DISubprogram(name: "RemoveDisplayProfile", linkageName: "\01?RemoveDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !35, file: !35, line: 114, type: !36, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false)
!35 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!36 = !DISubroutineType(types: !37)
!37 = !{!7, !7, !17}
!38 = !DISubprogram(name: "RemoveSRGBCurve", linkageName: "\01?RemoveSRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !39, file: !39, line: 43, type: !40, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!40 = !DISubroutineType(types: !41)
!41 = !{!7, !7}
!42 = !DISubprogram(name: "RGBLimitedToFull10bit", linkageName: "\01?RGBLimitedToFull10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !35, file: !35, line: 76, type: !40, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubprogram(name: "RemoveREC709Curve", linkageName: "\01?RemoveREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !39, file: !39, line: 68, type: !40, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DISubprogram(name: "REC2020toREC709", linkageName: "\01?REC2020toREC709@@YA?AV?$vector@M$02@@V1@@Z", scope: !39, file: !39, line: 131, type: !40, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubprogram(name: "RemoveREC2084Curve", linkageName: "\01?RemoveREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !39, file: !39, line: 86, type: !40, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !35, file: !35, line: 94, type: !36, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !39, file: !39, line: 37, type: !40, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !35, file: !35, line: 71, type: !40, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !39, file: !39, line: 63, type: !40, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !39, file: !39, line: 75, type: !40, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !39, file: !39, line: 120, type: !40, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!52 = !{!53, !57, !59, !76}
!53 = !DIGlobalVariable(name: "ColorTex", linkageName: "\01?ColorTex@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 16, type: !54, isLocal: false, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 16, size: 128, align: 32, elements: !2, templateParams: !55)
!55 = !{!56}
!56 = !DITemplateTypeParameter(name: "element", type: !8)
!57 = !DIGlobalVariable(name: "BilinearFilter", linkageName: "\01?BilinearFilter@@3USamplerState@@A", scope: !0, file: !1, line: 18, type: !58, isLocal: false, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 18, size: 32, align: 32, elements: !2)
!59 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC2020toREC709@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !44, file: !39, line: 133, type: !60, isLocal: false, isDefinition: true)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 133, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 133, size: 288, align: 32, elements: !63, templateParams: !73)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !62, file: !1, line: 133, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !62, file: !1, line: 133, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !62, file: !1, line: 133, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !62, file: !1, line: 133, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !62, file: !1, line: 133, baseType: !11, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !62, file: !1, line: 133, baseType: !11, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !62, file: !1, line: 133, baseType: !11, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !62, file: !1, line: 133, baseType: !11, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !62, file: !1, line: 133, baseType: !11, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!73 = !{!15, !74, !75}
!74 = !DITemplateValueParameter(name: "row_count", type: !17, value: i32 3)
!75 = !DITemplateValueParameter(name: "col_count", type: !17, value: i32 3)
!76 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !51, file: !39, line: 122, type: !60, isLocal: false, isDefinition: true)
!77 = !{i32 2, !"Dwarf Version", i32 4}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!80 = !{!"Shaders\5CBilinearUpsamplePS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A\0D\0A#include \22ShaderUtility.hlsli\22\0D\0A#include \22PresentRS.hlsli\22\0D\0A\0D\0ATexture2D<float3> ColorTex : register(t0);\0D\0A\0D\0ASamplerState BilinearFilter : register(s0);\0D\0A\0D\0A[RootSignature(Present_RootSig)]\0D\0Afloat3 main( float4 position : SV_Position, float2 uv : TexCoord0 ) : SV_Target0\0D\0A{\0D\0A    float3 LinearRGB = RemoveDisplayProfile(ColorTex.SampleLevel(BilinearFilter, uv, 0), LDR_COLOR_FORMAT);\0D\0A    return ApplyDisplayProfile(LinearRGB, DISPLAY_PLANE_FORMAT);\0D\0A}\0D\0A"}
