#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 1fd3a2f21935dba3bd8827858a144831.pdb
; shader hash: 1fd3a2f21935dba3bd8827858a144831
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float PaperWhiteRatio;                        ; Offset:    0
;       float MaxBrightness;                          ; Offset:    4
;   
;   } CB0;                                            ; Offset:    0 Size:     8
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !42)
!1 = !DIFile(filename: "Shaders\5CBlendUIHDRPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 28, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 28, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 22, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 22, size: 128, align: 32, elements: !15, templateParams: !21)
!15 = !{!16, !18, !19, !20}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !14, file: !1, line: 22, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !14, file: !1, line: 22, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !14, file: !1, line: 22, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !14, file: !1, line: 22, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !17)
!23 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!24 = !{!25, !28, !40, !41}
!25 = !DISubprogram(name: "main", scope: !1, file: !1, line: 26, type: !26, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!26 = !DISubroutineType(types: !27)
!27 = !{!13, !13}
!28 = !DISubprogram(name: "RemoveSRGBCurve", linkageName: "\01?RemoveSRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !29, file: !29, line: 43, type: !30, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!29 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !32}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 17, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 17, size: 96, align: 32, elements: !34, templateParams: !38)
!34 = !{!35, !36, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !33, file: !1, line: 17, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !33, file: !1, line: 17, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !33, file: !1, line: 17, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!38 = !{!22, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!40 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !29, file: !29, line: 120, type: !30, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!41 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !29, file: !29, line: 75, type: !30, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!42 = !{!43, !45, !46, !50}
!43 = !DIGlobalVariable(name: "PaperWhiteRatio", linkageName: "\01?PaperWhiteRatio@CB0@@3MB", scope: !0, file: !1, line: 21, type: !44, isLocal: false, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!45 = !DIGlobalVariable(name: "MaxBrightness", linkageName: "\01?MaxBrightness@CB0@@3MB", scope: !0, file: !1, line: 22, type: !44, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariable(name: "Overlay", linkageName: "\01?Overlay@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 17, type: !47, isLocal: false, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 17, size: 160, align: 32, elements: !2, templateParams: !48)
!48 = !{!49}
!49 = !DITemplateTypeParameter(name: "element", type: !14)
!50 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !40, file: !29, line: 122, type: !51, isLocal: false, isDefinition: true)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 122, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 122, size: 288, align: 32, elements: !54, templateParams: !64)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !53, file: !1, line: 122, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !53, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !53, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !53, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !53, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !53, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !53, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !53, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !53, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!64 = !{!22, !65, !66}
!65 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 3)
!66 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 3)
!67 = !{i32 2, !"Dwarf Version", i32 4}
!68 = !{i32 2, !"Debug Info Version", i32 3}
!69 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!70 = !{!"Shaders\5CBlendUIHDRPS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#include \22PresentRS.hlsli\22\0D\0A#include \22ColorSpaceUtility.hlsli\22\0D\0A\0D\0ATexture2D<float4> Overlay : register(t0);\0D\0A\0D\0Acbuffer CB0 : register(b0)\0D\0A{\0D\0A    float PaperWhiteRatio; // PaperWhite / 10000.0\0D\0A    float MaxBrightness;\0D\0A}\0D\0A\0D\0A[RootSignature(Present_RootSig)]\0D\0Afloat4 main( float4 position : SV_Position ) : SV_Target0\0D\0A{\0D\0A    float4 UI = Overlay[(int2)position.xy];\0D\0A    UI.rgb = RemoveSRGBCurve(UI.rgb);\0D\0A    UI.rgb = REC709toREC2020(UI.rgb / (UI.a == 0.0 ? 1.0 : UI.a));\0D\0A    UI.rgb = ApplyREC2084Curve(UI.rgb * PaperWhiteRatio);\0D\0A    return float4(UI.rgb, 1) * UI.a;\0D\0A}\0D\0A"}
