#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 12eef6609dde5e4784a1ba443cb8c49a.pdb
; shader hash: 12eef6609dde5e4784a1ba443cb8c49a
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB1
; {
;
;   struct hostlayout.CB1
;   {
;
;       column_major float4x4 CurToPrevXForm;         ; Offset:    0
;   
;   } CB1;                                            ; Offset:    0 Size:    64
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CB1                               cbuffer      NA          NA     CB0            cb1     1
; ColorBuffer                       texture     f32          2d      T0             t0     1
; DepthBuffer                       texture     f32          2d      T1             t1     1
; PrepBuffer                            UAV     f32          2d      U0             u0     1
; VelocityBuffer                        UAV     u32          2d      U1             u1     1
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !56)
!1 = !DIFile(filename: "Shaders\5CCameraMotionBlurPrePassCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !25}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 63, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 63, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 63, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 64, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 64, size: 128, align: 32, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 64, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 64, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 64, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 64, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 51, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 24, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 24, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 24, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 24, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!23, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!33 = !{!34, !45, !48, !52, !55}
!34 = !DISubprogram(name: "main", scope: !1, file: !1, line: 61, type: !35, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !44, !37, !37}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 31, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 31, size: 96, align: 32, elements: !39, templateParams: !43)
!39 = !{!40, !41, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !{!11, !32}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 31, baseType: !8)
!45 = !DISubprogram(name: "GetSampleData", linkageName: "\01?GetSampleData@@YA?AV?$vector@M$03@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 34, type: !46, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!14, !4}
!48 = !DISubprogram(name: "PackVelocity", linkageName: "\01?PackVelocity@@YAIV?$vector@M$02@@@Z", scope: !49, file: !49, line: 51, type: !50, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DIFile(filename: "Shaders/PixelPacking_Velocity.hlsli", directory: "")
!50 = !DISubroutineType(types: !51)
!51 = !{!44, !25}
!52 = !DISubprogram(name: "PackXY", linkageName: "\01?PackXY@@YAIM@Z", scope: !49, file: !49, line: 25, type: !53, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!44, !18}
!55 = !DISubprogram(name: "PackZ", linkageName: "\01?PackZ@@YAIM@Z", scope: !49, file: !49, line: 38, type: !53, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false)
!56 = !{!57, !79, !83, !86, !90}
!57 = !DIGlobalVariable(name: "CurToPrevXForm", linkageName: "\01?CurToPrevXForm@CB1@@3V?$matrix@M$03$03@@A", scope: !0, file: !1, line: 31, type: !58, isLocal: false, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 31, size: 512, align: 32, elements: !59, templateParams: !76)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !58, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!76 = !{!23, !77, !78}
!77 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!78 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!79 = !DIGlobalVariable(name: "ColorBuffer", linkageName: "\01?ColorBuffer@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 24, type: !80, isLocal: false, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 24, size: 128, align: 32, elements: !2, templateParams: !81)
!81 = !{!82}
!82 = !DITemplateTypeParameter(name: "element", type: !26)
!83 = !DIGlobalVariable(name: "DepthBuffer", linkageName: "\01?DepthBuffer@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 25, type: !84, isLocal: false, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 25, size: 64, align: 32, elements: !2, templateParams: !85)
!85 = !{!23}
!86 = !DIGlobalVariable(name: "PrepBuffer", linkageName: "\01?PrepBuffer@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 26, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 26, size: 128, align: 32, elements: !2, templateParams: !88)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "element", type: !15)
!90 = !DIGlobalVariable(name: "VelocityBuffer", linkageName: "\01?VelocityBuffer@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 27, type: !91, isLocal: false, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned int>", file: !1, line: 27, size: 32, align: 32, elements: !2, templateParams: !92)
!92 = !{!11}
!93 = !{i32 2, !"Dwarf Version", i32 4}
!94 = !{i32 2, !"Debug Info Version", i32 3}
!95 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!96 = !{!"Shaders\5CCameraMotionBlurPrePassCS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#include \22CommonRS.hlsli\22\0D\0A#include \22PixelPacking_Velocity.hlsli\22\0D\0A\0D\0A// We can use the original depth buffer or a linearized one.  In this case, we use linear Z because\0D\0A// we have discarded the 32-bit depth buffer but still retain a 16-bit linear buffer (previously\0D\0A// used by SSAO.)  Note that hyperbolic Z is reversed by default (TBD) for increased precision, so\0D\0A// its Z=0 maps to the far plane.  With linear Z, Z=0 maps to the eye position.  Both extend to Z=1.\0D\0A\0D\0A//#define USE_LINEAR_Z\0D\0A\0D\0ATexture2D<float3> ColorBuffer : register(t0);\0D\0ATexture2D<float> DepthBuffer : register(t1);\0D\0ARWTexture2D<float4> PrepBuffer : register(u0);\0D\0ARWTexture2D<packed_velocity_t> VelocityBuffer : register(u1);\0D\0A\0D\0Acbuffer CB1 : register(b1)\0D\0A{\0D\0A    matrix CurToPrevXForm;\0D\0A}\0D\0A\0D\0Afloat4 GetSampleData( uint2 st )\0D\0A{\0D\0A    float2 CurPixel = st + 0.5;\0D\0A    float Depth = DepthBuffer[st];\0D\0A#ifdef USE_LINEAR_Z\0D\0A    float4 HPos = float4( CurPixel * Depth, 1.0, Depth );\0D\0A#else\0D\0A    float4 HPos = float4( CurPixel, Depth, 1.0 );\0D\0A#endif\0D\0A    float4 PrevHPos = mul( CurToPrevXForm, HPos );\0D\0A\0D\0A    PrevHPos.xyz /= PrevHPos.w;\0D\0A\0D\0A#ifdef USE_LINEAR_Z\0D\0A    PrevHPos.z = PrevHPos.w;\0D\0A#endif\0D\0A\0D\0A    float3 Velocity = PrevHPos.xyz - float3(CurPixel, Depth);\0D\0A\0D\0A    VelocityBuffer[st] = PackVelocity(Velocity);\0D\0A\0D\0A    // Clamp speed at 4 pixels and normalize it.\0D\0A    return float4(ColorBuffer[st], 1.0) * saturate(length(Velocity.xy) / 4);\0D\0A}\0D\0A\0D\0A[RootSignature(Common_RootSig)]\0D\0A[numthreads( 8, 8, 1 )]\0D\0Avoid main( uint3 Gid : SV_GroupID, uint GI : SV_GroupIndex, uint3 GTid : SV_GroupThreadID, uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    uint2 corner = DTid.xy << 1;\0D\0A    float4 sample0 = GetSampleData( corner + uint2(0, 0) );\0D\0A    float4 sample1 = GetSampleData( corner + uint2(1, 0) );\0D\0A    float4 sample2 = GetSampleData( corner + uint2(0, 1) );\0D\0A    float4 sample3 = GetSampleData( corner + uint2(1, 1) );\0D\0A\0D\0A    float combinedMotionWeight = sample0.a + sample1.a + sample2.a + sample3.a;\0D\0A    PrepBuffer[DTid.xy] = floor(0.25 * combinedMotionWeight * 3.0) / 3.0 * float4(\0D\0A        (sample0.rgb + sample1.rgb + sample2.rgb + sample3.rgb) / combinedMotionWeight, 1.0 );\0D\0A}\0D\0A"}
!97 = !{!"Shaders\5CCommonRS.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard \0A//\0A\0A#define Common_RootSig \5C\0A    \22RootFlags(0), \22 \5C\0A    \22RootConstants(b0, num32BitConstants = 4),\22 \5C\0A    \22DescriptorTable(SRV(t0, numDescriptors = 10)),\22 \5C\0A    \22DescriptorTable(UAV(u0, numDescriptors = 10)),\22 \5C\0A    \22CBV(b1), \22 \5C\0A    \22StaticSampler(s0,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_LINEAR),\22 \5C\0A    \22StaticSampler(s1,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22borderColor = STATIC_BORDER_COLOR_TRANSPARENT_BLACK,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_POINT),\22 \5C\0A    \22StaticSampler(s2,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22borderColor = STATIC_BORDER_COLOR_TRANSPARENT_BLACK,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_LINEAR)\22\0A\0A"}
!98 = !{!"Shaders\5CPixelPacking_Velocity.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard \0A//\0A\0A#ifndef __PIXEL_PACKING_VELOCITY_HLSLI__\0A#define __PIXEL_PACKING_VELOCITY_HLSLI__\0A\0A#if 1\0A// This is a custom packing that devotes 10 bits each to X and Y velocity but 12 bits to Z velocity.  Floats\0A// are used instead of SNORM to increase precision around small deltas, which are the majority of deltas.\0A// With TAA and Motion Blur, velocities are clamped, giving little reason to express them precisely in terms\0A// of the size of the screen.\0A#define packed_velocity_t uint\0A\0A// Designed to compress (-256.0, +256.0) with a signed 6e3 float\0Auint PackXY( float x )\0A{\0A    uint signbit = asuint(x) >> 31;\0A    x = clamp(abs(x / 32768.0), 0, asfloat(0x3BFFE000));\0A    return (f32tof16(x) + 8) >> 4 | signbit << 9;\0A}\0A\0Afloat UnpackXY( uint x )\0A{\0A    return f16tof32((x & 0x1FF) << 4 | (x >> 9) << 15) * 32768.0;\0A}\0A\0A// Designed to compress (-1.0, 1.0) with a signed 8e3 float\0Auint PackZ( float x )\0A{\0A    uint signbit = asuint(x) >> 31;\0A    x = clamp(abs(x / 128.0), 0, asfloat(0x3BFFE000));\0A    return (f32tof16(x) + 2) >> 2 | signbit << 11;\0A}\0A\0Afloat UnpackZ( uint x )\0A{\0A    return f16tof32((x & 0x7FF) << 2 | (x >> 11) << 15) * 128.0;\0A}\0A\0A// Pack the velocity to write to R10G10B10A2_UNORM\0Apacked_velocity_t PackVelocity( float3 Velocity )\0A{\0A    return PackXY(Velocity.x) | PackXY(Velocity.y) << 10 | PackZ(Velocity.z) << 20;\0A}\0A\0A// Unpack the velocity from R10G10B10A2_UNORM\0Afloat3 UnpackVelocity( packed_velocity_t Velocity )\0A{\0A    return float3(UnpackXY(Velocity & 0x3FF), UnpackXY((Velocity >> 10) & 0x3FF), UnpackZ(Velocity >> 20));\0A}\0A\0A#elif 1\0A#define packed_velocity_t float4\0A\0A// Pack the velocity to write to R10G10B10A2_UNORM\0Apacked_velocity_t PackVelocity( float3 Velocity )\0A{\0A    // Stretch dx,dy from [-64, 63.875] to [-512, 511] to [-0.5, 0.5) to [0, 1)\0A    // Velocity.xy = (0,0) must be representable.\0A    return float4(Velocity * float3(8, 8, 4096) / 1024.0 + 512 / 1023.0, 0);\0A}\0A\0A// Unpack the velocity from R10G10B10A2_UNORM\0Afloat3 UnpackVelocity( packed_velocity_t Velocity )\0A{\0A    return (Velocity.xyz - 512.0 / 1023.0) * float3(1024, 1024, 2) / 8.0;\0A}\0A#else\0A#define packed_velocity_t float4\0A\0A// Pack the velocity to write to R16G16B16A16_FLOAT\0Apacked_velocity_t PackVelocity( float3 Velocity )\0A{\0A    return float4(Velocity * float3(16, 16, 32*1024), 0);\0A}\0A\0A// Unpack the velocity from R10G10B10A2_UNORM\0Afloat3 UnpackVelocity( packed_velocity_t Velocity )\0A{\0A    return Velocity.xyz / float3(16, 16, 32*1024);\0A}\0A\0A#endif\0A\0A#endif // __PIXEL_PACKING_HLSLI__\0A"}
!99 = !{!"_GAMING_DESKTOP=1", !"_GAMING_DESKTOP=1"}
!100 = !{!"Shaders\5CCameraMotionBlurPrePassCS.hlsl"}
!101 = !{!"-E", !"main", !"-T", !"cs_6_2", !"/D", !"_GAMING_DESKTOP=1", !"/Od", !"/Zi", !"-D", !"_GAMING_DESKTOP=1", !"-Qembed_debug"}
!102 = !{i32 1, i32 2}
!103 = !{i32 1, i32 6}
!104 = !{!"cs", i32 6, i32 2}
!105 = !{!106, !110, !114, null}
!106 = !{!107, !109}
!107 = !{i32 0, %"class.Texture2D<vector<float, 3> >"* undef, !"ColorBuffer", i32 0, i32 0, i32 1, i32 2, i32 0, !108}
!108 = !{i32 0, i32 9}
!109 = !{i32 1, %"class.Texture2D<float>"* undef, !"DepthBuffer", i32 0, i32 1, i32 1, i32 2, i32 0, !108}
!110 = !{!111, !112}
!111 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* undef, !"PrepBuffer", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !108}
!112 = !{i32 1, %"class.RWTexture2D<unsigned int>"* undef, !"VelocityBuffer", i32 0, i32 1, i32 1, i32 2, i1 false, i1 false, i1 false, !113}
!113 = !{i32 0, i32 5}
!114 = !{!115}
!115 = !{i32 0, %hostlayout.CB1* undef, !"CB1", i32 0, i32 1, i32 1, i32 64, null}
!116 = !{i32 0, %hostlayout.CB1 undef, !117}
!117 = !{i32 64, !118}
!118 = !{i32 6, !"CurToPrevXForm", i32 2, !119, i32 3, i32 0, i32 7, i32 9}
!119 = !{i32 4, i32 4, i32 2}
!120 = !{i32 1, void ()* @main, !121}
!121 = !{!122}
!122 = !{i32 0, !2, !2}
!123 = !{void ()* @main, !"main", null, !105, !124}
!124 = !{i32 0, i64 1, i32 4, !125}
!125 = !{i32 8, i32 8, i32 1}
!126 = !DILocation(line: 37, column: 19, scope: !45, inlinedAt: !127)
!127 = distinct !DILocation(line: 67, column: 22, scope: !34)
!128 = !DILocation(line: 61, column: 98, scope: !34)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DTid", arg: 4, scope: !34, file: !1, line: 61, type: !37)
!130 = !DIExpression(DW_OP_bit_piece, 0, 32)
!131 = !DIExpression(DW_OP_bit_piece, 32, 32)
!132 = !DILocation(line: 63, column: 28, scope: !34)
!133 = !DILocation(line: 63, column: 11, scope: !34)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "corner", scope: !34, file: !1, line: 63, type: !4)
!135 = !DILocation(line: 64, column: 44, scope: !34)
!136 = !DILocation(line: 64, column: 22, scope: !34)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "st", arg: 1, scope: !45, file: !1, line: 34, type: !4)
!138 = !DILocation(line: 34, column: 29, scope: !45, inlinedAt: !139)
!139 = distinct !DILocation(line: 64, column: 22, scope: !34)
!140 = !DILocation(line: 36, column: 23, scope: !45, inlinedAt: !139)
!141 = !DILocation(line: 36, column: 26, scope: !45, inlinedAt: !139)
!142 = !DILocation(line: 36, column: 12, scope: !45, inlinedAt: !139)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "CurPixel", scope: !45, file: !1, line: 36, type: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 36, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 36, size: 64, align: 32, elements: !146, templateParams: !149)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !145, file: !1, line: 36, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !145, file: !1, line: 36, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!149 = !{!23, !12}
!150 = !DILocation(line: 37, column: 19, scope: !45, inlinedAt: !139)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Depth", scope: !45, file: !1, line: 37, type: !18)
!152 = !DIExpression()
!153 = !DILocation(line: 37, column: 11, scope: !45, inlinedAt: !139)
!154 = !DILocation(line: 41, column: 12, scope: !45, inlinedAt: !139)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "HPos", scope: !45, file: !1, line: 41, type: !14)
!156 = !DIExpression(DW_OP_bit_piece, 64, 32)
!157 = !DIExpression(DW_OP_bit_piece, 96, 32)
!158 = !DILocation(line: 43, column: 28, scope: !45, inlinedAt: !139)
!159 = !DILocation(line: 43, column: 23, scope: !45, inlinedAt: !139)
!160 = !DILocation(line: 43, column: 12, scope: !45, inlinedAt: !139)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PrevHPos", scope: !45, file: !1, line: 43, type: !14)
!162 = !DILocation(line: 45, column: 18, scope: !45, inlinedAt: !139)
!163 = !DILocation(line: 51, column: 36, scope: !45, inlinedAt: !139)
!164 = !DILocation(line: 51, column: 12, scope: !45, inlinedAt: !139)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Velocity", scope: !45, file: !1, line: 51, type: !25)
!166 = !DILocation(line: 53, column: 26, scope: !45, inlinedAt: !139)
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Velocity", arg: 1, scope: !48, file: !49, line: 51, type: !25)
!168 = !DILocation(line: 51, column: 40, scope: !48, inlinedAt: !169)
!169 = distinct !DILocation(line: 53, column: 26, scope: !45, inlinedAt: !139)
!170 = !DILocation(line: 53, column: 12, scope: !48, inlinedAt: !169)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !52, file: !49, line: 25, type: !18)
!172 = !DILocation(line: 25, column: 20, scope: !52, inlinedAt: !173)
!173 = distinct !DILocation(line: 53, column: 12, scope: !48, inlinedAt: !169)
!174 = !DILocation(line: 27, column: 20, scope: !52, inlinedAt: !173)
!175 = !DILocation(line: 27, column: 30, scope: !52, inlinedAt: !173)
!176 = !DILocation(line: 27, column: 10, scope: !52, inlinedAt: !173)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signbit", scope: !52, file: !49, line: 27, type: !44)
!178 = !DILocation(line: 28, column: 21, scope: !52, inlinedAt: !173)
!179 = !DILocation(line: 28, column: 15, scope: !52, inlinedAt: !173)
!180 = !DILocation(line: 28, column: 9, scope: !52, inlinedAt: !173)
!181 = !DILocation(line: 29, column: 13, scope: !52, inlinedAt: !173)
!182 = !DILocation(line: 29, column: 25, scope: !52, inlinedAt: !173)
!183 = !DILocation(line: 29, column: 30, scope: !52, inlinedAt: !173)
!184 = !DILocation(line: 29, column: 45, scope: !52, inlinedAt: !173)
!185 = !DILocation(line: 29, column: 35, scope: !52, inlinedAt: !173)
!186 = !DILocation(line: 29, column: 5, scope: !52, inlinedAt: !173)
!187 = !DILocation(line: 53, column: 33, scope: !48, inlinedAt: !169)
!188 = !DILocation(line: 25, column: 20, scope: !52, inlinedAt: !189)
!189 = distinct !DILocation(line: 53, column: 33, scope: !48, inlinedAt: !169)
!190 = !DILocation(line: 27, column: 20, scope: !52, inlinedAt: !189)
!191 = !DILocation(line: 27, column: 30, scope: !52, inlinedAt: !189)
!192 = !DILocation(line: 27, column: 10, scope: !52, inlinedAt: !189)
!193 = !DILocation(line: 28, column: 21, scope: !52, inlinedAt: !189)
!194 = !DILocation(line: 28, column: 15, scope: !52, inlinedAt: !189)
!195 = !DILocation(line: 28, column: 9, scope: !52, inlinedAt: !189)
!196 = !DILocation(line: 29, column: 13, scope: !52, inlinedAt: !189)
!197 = !DILocation(line: 29, column: 25, scope: !52, inlinedAt: !189)
!198 = !DILocation(line: 29, column: 30, scope: !52, inlinedAt: !189)
!199 = !DILocation(line: 29, column: 45, scope: !52, inlinedAt: !189)
!200 = !DILocation(line: 29, column: 35, scope: !52, inlinedAt: !189)
