#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 633b51bec7669a4c4eb3a9da7858e196.pdb
; shader hash: 633b51bec7669a4c4eb3a9da7858e196
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CBuffer
; {
;
;   struct hostlayout.CBuffer
;   {
;
;       column_major float4x4 CurToPrevXForm;         ; Offset:    0
;   
;   } CBuffer;                                        ; Offset:    0 Size:    64
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CBuffer                           cbuffer      NA          NA     CB0            cb1     1
; DepthBuffer                       texture     f32          2d      T0             t0     1
; VelocityBuffer                        UAV     u32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%dx.types.Handle = type { i8* }
%dx.types.ResRet.f32 = type { float, float, float, float, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !46)
!1 = !DIFile(filename: "Shaders\5CCameraVelocityCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 39, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 39, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 39, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 51, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 51, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 51, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !{!25, !37, !42, !45}
!25 = !DISubprogram(name: "main", scope: !1, file: !1, line: 33, type: !26, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 28, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 28, size: 96, align: 32, elements: !30, templateParams: !35)
!30 = !{!31, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, line: 28, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, line: 28, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !29, file: !1, line: 28, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !{!36, !23}
!36 = !DITemplateTypeParameter(name: "element", type: !32)
!37 = !DISubprogram(name: "PackVelocity", linkageName: "\01?PackVelocity@@YAIV?$vector@M$02@@@Z", scope: !38, file: !38, line: 51, type: !39, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DIFile(filename: "Shaders/PixelPacking_Velocity.hlsli", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !16}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 24, baseType: !32)
!42 = !DISubprogram(name: "PackXY", linkageName: "\01?PackXY@@YAIM@Z", scope: !38, file: !38, line: 25, type: !43, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!41, !8}
!45 = !DISubprogram(name: "PackZ", linkageName: "\01?PackZ@@YAIM@Z", scope: !38, file: !38, line: 38, type: !43, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false)
!46 = !{!47, !69, !72}
!47 = !DIGlobalVariable(name: "CurToPrevXForm", linkageName: "\01?CurToPrevXForm@CBuffer@@3V?$matrix@M$03$03@@A", scope: !0, file: !1, line: 28, type: !48, isLocal: false, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 28, size: 512, align: 32, elements: !49, templateParams: !66)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !48, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!66 = !{!13, !67, !68}
!67 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!68 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!69 = !DIGlobalVariable(name: "DepthBuffer", linkageName: "\01?DepthBuffer@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 23, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 23, size: 64, align: 32, elements: !2, templateParams: !71)
!71 = !{!13}
!72 = !DIGlobalVariable(name: "VelocityBuffer", linkageName: "\01?VelocityBuffer@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 24, type: !73, isLocal: false, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned int>", file: !1, line: 24, size: 32, align: 32, elements: !2, templateParams: !74)
!74 = !{!36}
!75 = !{i32 2, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!78 = !{!"Shaders\5CCameraVelocityCS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#include \22CommonRS.hlsli\22\0D\0A#include \22PixelPacking_Velocity.hlsli\22\0D\0A\0D\0A// We can use the original depth buffer or a linearized one.  In this case, we use linear Z because\0D\0A// we have discarded the 32-bit depth buffer but still retain a 16-bit linear buffer (previously\0D\0A// used by SSAO.)  Note that hyperbolic Z is reversed by default (TBD) for increased precision, so\0D\0A// its Z=0 maps to the far plane.  With linear Z, Z=0 maps to the eye position.  Both extend to Z=1.\0D\0A#define USE_LINEAR_Z\0D\0A\0D\0ATexture2D<float> DepthBuffer : register(t0);\0D\0ARWTexture2D<packed_velocity_t> VelocityBuffer : register(u0);\0D\0A\0D\0Acbuffer CBuffer : register(b1)\0D\0A{\0D\0A    matrix CurToPrevXForm;\0D\0A}\0D\0A\0D\0A[RootSignature(Common_RootSig)]\0D\0A[numthreads( 8, 8, 1 )]\0D\0Avoid main( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    uint2 st = DTid.xy;\0D\0A    float2 CurPixel = st + 0.5;\0D\0A    float Depth = DepthBuffer[st];\0D\0A#ifdef USE_LINEAR_Z\0D\0A    float4 HPos = float4( CurPixel * Depth, 1.0, Depth );\0D\0A#else\0D\0A    float4 HPos = float4( CurPixel, Depth, 1.0 );\0D\0A#endif\0D\0A    float4 PrevHPos = mul( CurToPrevXForm, HPos );\0D\0A\0D\0A    PrevHPos.xyz /= PrevHPos.w;\0D\0A\0D\0A#ifdef USE_LINEAR_Z\0D\0A    PrevHPos.z = PrevHPos.w;\0D\0A#endif\0D\0A\0D\0A    VelocityBuffer[st] = PackVelocity(PrevHPos.xyz - float3(CurPixel, Depth));\0D\0A}\0D\0A"}
!79 = !{!"Shaders\5CCommonRS.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard \0A//\0A\0A#define Common_RootSig \5C\0A    \22RootFlags(0), \22 \5C\0A    \22RootConstants(b0, num32BitConstants = 4),\22 \5C\0A    \22DescriptorTable(SRV(t0, numDescriptors = 10)),\22 \5C\0A    \22DescriptorTable(UAV(u0, numDescriptors = 10)),\22 \5C\0A    \22CBV(b1), \22 \5C\0A    \22StaticSampler(s0,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_LINEAR),\22 \5C\0A    \22StaticSampler(s1,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22borderColor = STATIC_BORDER_COLOR_TRANSPARENT_BLACK,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_POINT),\22 \5C\0A    \22StaticSampler(s2,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22borderColor = STATIC_BORDER_COLOR_TRANSPARENT_BLACK,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_LINEAR)\22\0A\0A"}
!80 = !{!"Shaders\5CPixelPacking_Velocity.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard \0A//\0A\0A#ifndef __PIXEL_PACKING_VELOCITY_HLSLI__\0A#define __PIXEL_PACKING_VELOCITY_HLSLI__\0A\0A#if 1\0A// This is a custom packing that devotes 10 bits each to X and Y velocity but 12 bits to Z velocity.  Floats\0A// are used instead of SNORM to increase precision around small deltas, which are the majority of deltas.\0A// With TAA and Motion Blur, velocities are clamped, giving little reason to express them precisely in terms\0A// of the size of the screen.\0A#define packed_velocity_t uint\0A\0A// Designed to compress (-256.0, +256.0) with a signed 6e3 float\0Auint PackXY( float x )\0A{\0A    uint signbit = asuint(x) >> 31;\0A    x = clamp(abs(x / 32768.0), 0, asfloat(0x3BFFE000));\0A    return (f32tof16(x) + 8) >> 4 | signbit << 9;\0A}\0A\0Afloat UnpackXY( uint x )\0A{\0A    return f16tof32((x & 0x1FF) << 4 | (x >> 9) << 15) * 32768.0;\0A}\0A\0A// Designed to compress (-1.0, 1.0) with a signed 8e3 float\0Auint PackZ( float x )\0A{\0A    uint signbit = asuint(x) >> 31;\0A    x = clamp(abs(x / 128.0), 0, asfloat(0x3BFFE000));\0A    return (f32tof16(x) + 2) >> 2 | signbit << 11;\0A}\0A\0Afloat UnpackZ( uint x )\0A{\0A    return f16tof32((x & 0x7FF) << 2 | (x >> 11) << 15) * 128.0;\0A}\0A\0A// Pack the velocity to write to R10G10B10A2_UNORM\0Apacked_velocity_t PackVelocity( float3 Velocity )\0A{\0A    return PackXY(Velocity.x) | PackXY(Velocity.y) << 10 | PackZ(Velocity.z) << 20;\0A}\0A\0A// Unpack the velocity from R10G10B10A2_UNORM\0Afloat3 UnpackVelocity( packed_velocity_t Velocity )\0A{\0A    return float3(UnpackXY(Velocity & 0x3FF), UnpackXY((Velocity >> 10) & 0x3FF), UnpackZ(Velocity >> 20));\0A}\0A\0A#elif 1\0A#define packed_velocity_t float4\0A\0A// Pack the velocity to write to R10G10B10A2_UNORM\0Apacked_velocity_t PackVelocity( float3 Velocity )\0A{\0A    // Stretch dx,dy from [-64, 63.875] to [-512, 511] to [-0.5, 0.5) to [0, 1)\0A    // Velocity.xy = (0,0) must be representable.\0A    return float4(Velocity * float3(8, 8, 4096) / 1024.0 + 512 / 1023.0, 0);\0A}\0A\0A// Unpack the velocity from R10G10B10A2_UNORM\0Afloat3 UnpackVelocity( packed_velocity_t Velocity )\0A{\0A    return (Velocity.xyz - 512.0 / 1023.0) * float3(1024, 1024, 2) / 8.0;\0A}\0A#else\0A#define packed_velocity_t float4\0A\0A// Pack the velocity to write to R16G16B16A16_FLOAT\0Apacked_velocity_t PackVelocity( float3 Velocity )\0A{\0A    return float4(Velocity * float3(16, 16, 32*1024), 0);\0A}\0A\0A// Unpack the velocity from R10G10B10A2_UNORM\0Afloat3 UnpackVelocity( packed_velocity_t Velocity )\0A{\0A    return Velocity.xyz / float3(16, 16, 32*1024);\0A}\0A\0A#endif\0A\0A#endif // __PIXEL_PACKING_HLSLI__\0A"}
!81 = !{!"_GAMING_DESKTOP=1", !"_GAMING_DESKTOP=1"}
!82 = !{!"Shaders\5CCameraVelocityCS.hlsl"}
!83 = !{!"-E", !"main", !"-T", !"cs_6_2", !"/D", !"_GAMING_DESKTOP=1", !"/Od", !"/Zi", !"-D", !"_GAMING_DESKTOP=1", !"-Qembed_debug"}
!84 = !{i32 1, i32 2}
!85 = !{i32 1, i32 6}
!86 = !{!"cs", i32 6, i32 2}
!87 = !{!88, !91, !94, null}
!88 = !{!89}
!89 = !{i32 0, %"class.Texture2D<float>"* undef, !"DepthBuffer", i32 0, i32 0, i32 1, i32 2, i32 0, !90}
!90 = !{i32 0, i32 9}
!91 = !{!92}
!92 = !{i32 0, %"class.RWTexture2D<unsigned int>"* undef, !"VelocityBuffer", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !93}
!93 = !{i32 0, i32 5}
!94 = !{!95}
!95 = !{i32 0, %hostlayout.CBuffer* undef, !"CBuffer", i32 0, i32 1, i32 1, i32 64, null}
!96 = !{i32 0, %hostlayout.CBuffer undef, !97}
!97 = !{i32 64, !98}
!98 = !{i32 6, !"CurToPrevXForm", i32 2, !99, i32 3, i32 0, i32 7, i32 9}
!99 = !{i32 4, i32 4, i32 2}
!100 = !{i32 1, void ()* @main, !101}
!101 = !{!102}
!102 = !{i32 0, !2, !2}
!103 = !{void ()* @main, !"main", null, !87, !104}
!104 = !{i32 0, i64 1, i32 4, !105}
!105 = !{i32 8, i32 8, i32 1}
!106 = !DILocation(line: 37, column: 19, scope: !25)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DTid", arg: 1, scope: !25, file: !1, line: 33, type: !28)
!108 = !DIExpression(DW_OP_bit_piece, 0, 32)
!109 = !DILocation(line: 33, column: 18, scope: !25)
!110 = !DIExpression(DW_OP_bit_piece, 32, 32)
!111 = !DILocation(line: 35, column: 11, scope: !25)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !25, file: !1, line: 35, type: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 35, baseType: !114)
!114 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 35, size: 64, align: 32, elements: !115, templateParams: !118)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !114, file: !1, line: 35, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !114, file: !1, line: 35, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!118 = !{!36, !119}
!119 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!120 = !DILocation(line: 36, column: 23, scope: !25)
!121 = !DILocation(line: 36, column: 26, scope: !25)
!122 = !DILocation(line: 36, column: 12, scope: !25)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "CurPixel", scope: !25, file: !1, line: 36, type: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 36, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 36, size: 64, align: 32, elements: !126, templateParams: !129)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !125, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !125, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!129 = !{!13, !119}
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Depth", scope: !25, file: !1, line: 37, type: !8)
!131 = !DIExpression()
!132 = !DILocation(line: 37, column: 11, scope: !25)
!133 = !DILocation(line: 39, column: 36, scope: !25)
!134 = !DILocation(line: 39, column: 12, scope: !25)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "HPos", scope: !25, file: !1, line: 39, type: !4)
!136 = !DIExpression(DW_OP_bit_piece, 64, 32)
!137 = !DIExpression(DW_OP_bit_piece, 96, 32)
!138 = !DILocation(line: 43, column: 28, scope: !25)
!139 = !DILocation(line: 43, column: 23, scope: !25)
!140 = !DILocation(line: 43, column: 12, scope: !25)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PrevHPos", scope: !25, file: !1, line: 43, type: !4)
!142 = !DILocation(line: 45, column: 18, scope: !25)
!143 = !DILocation(line: 48, column: 16, scope: !25)
!144 = !DILocation(line: 51, column: 52, scope: !25)
!145 = !DILocation(line: 51, column: 26, scope: !25)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Velocity", arg: 1, scope: !37, file: !38, line: 51, type: !16)
!147 = !DILocation(line: 51, column: 40, scope: !37, inlinedAt: !148)
!148 = distinct !DILocation(line: 51, column: 26, scope: !25)
!149 = !DILocation(line: 53, column: 12, scope: !37, inlinedAt: !148)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !42, file: !38, line: 25, type: !8)
!151 = !DILocation(line: 25, column: 20, scope: !42, inlinedAt: !152)
!152 = distinct !DILocation(line: 53, column: 12, scope: !37, inlinedAt: !148)
!153 = !DILocation(line: 27, column: 20, scope: !42, inlinedAt: !152)
!154 = !DILocation(line: 27, column: 30, scope: !42, inlinedAt: !152)
!155 = !DILocation(line: 27, column: 10, scope: !42, inlinedAt: !152)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signbit", scope: !42, file: !38, line: 27, type: !41)
!157 = !DILocation(line: 28, column: 21, scope: !42, inlinedAt: !152)
!158 = !DILocation(line: 28, column: 15, scope: !42, inlinedAt: !152)
!159 = !DILocation(line: 28, column: 9, scope: !42, inlinedAt: !152)
!160 = !DILocation(line: 29, column: 13, scope: !42, inlinedAt: !152)
!161 = !DILocation(line: 29, column: 25, scope: !42, inlinedAt: !152)
!162 = !DILocation(line: 29, column: 30, scope: !42, inlinedAt: !152)
!163 = !DILocation(line: 29, column: 45, scope: !42, inlinedAt: !152)
!164 = !DILocation(line: 29, column: 35, scope: !42, inlinedAt: !152)
!165 = !DILocation(line: 29, column: 5, scope: !42, inlinedAt: !152)
!166 = !DILocation(line: 53, column: 33, scope: !37, inlinedAt: !148)
!167 = !DILocation(line: 25, column: 20, scope: !42, inlinedAt: !168)
!168 = distinct !DILocation(line: 53, column: 33, scope: !37, inlinedAt: !148)
!169 = !DILocation(line: 27, column: 20, scope: !42, inlinedAt: !168)
!170 = !DILocation(line: 27, column: 30, scope: !42, inlinedAt: !168)
!171 = !DILocation(line: 27, column: 10, scope: !42, inlinedAt: !168)
!172 = !DILocation(line: 28, column: 21, scope: !42, inlinedAt: !168)
!173 = !DILocation(line: 28, column: 15, scope: !42, inlinedAt: !168)
!174 = !DILocation(line: 28, column: 9, scope: !42, inlinedAt: !168)
!175 = !DILocation(line: 29, column: 13, scope: !42, inlinedAt: !168)
!176 = !DILocation(line: 29, column: 25, scope: !42, inlinedAt: !168)
!177 = !DILocation(line: 29, column: 30, scope: !42, inlinedAt: !168)
!178 = !DILocation(line: 29, column: 45, scope: !42, inlinedAt: !168)
!179 = !DILocation(line: 29, column: 35, scope: !42, inlinedAt: !168)
!180 = !DILocation(line: 29, column: 5, scope: !42, inlinedAt: !168)
!181 = !DILocation(line: 53, column: 52, scope: !37, inlinedAt: !148)
!182 = !DILocation(line: 53, column: 31, scope: !37, inlinedAt: !148)
!183 = !DILocation(line: 53, column: 60, scope: !37, inlinedAt: !148)
