#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xy  
; TexCoord                 0   xy          1     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: 2204c949fe5f0481e89481ff747c9306.pdb
; shader hash: 2204c949fe5f0481e89481ff747c9306
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float PaperWhiteRatio;                        ; Offset:    0
;       float MaxBrightness;                          ; Offset:    4
;   
;   } CB0;                                            ; Offset:    0 Size:     8
;
; }
;
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !13, globals: !48)
!1 = !DIFile(filename: "Shaders\5CCompositeHDRPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 29, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !{!14, !42, !46, !47}
!14 = !DISubprogram(name: "main", scope: !1, file: !1, line: 27, type: !15, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !27, !36}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 23, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 23, size: 96, align: 32, elements: !19, templateParams: !24)
!19 = !{!20, !22, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !1, line: 23, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!21 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !18, file: !1, line: 23, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !18, file: !1, line: 23, baseType: !21, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!24 = !{!25, !26}
!25 = !DITemplateTypeParameter(name: "element", type: !21)
!26 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 23, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 23, size: 128, align: 32, elements: !29, templateParams: !34)
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, line: 23, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, line: 23, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !28, file: !1, line: 23, baseType: !21, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !28, file: !1, line: 23, baseType: !21, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!34 = !{!25, !35}
!35 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 23, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 23, size: 64, align: 32, elements: !38, templateParams: !41)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, line: 23, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, line: 23, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !{!25, !12}
!42 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !43, file: !43, line: 75, type: !44, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!44 = !DISubroutineType(types: !45)
!45 = !{!17, !17}
!46 = !DISubprogram(name: "RemoveSRGBCurve", linkageName: "\01?RemoveSRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !43, file: !43, line: 43, type: !44, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !43, file: !43, line: 120, type: !44, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!48 = !{!49, !51, !52, !56, !60}
!49 = !DIGlobalVariable(name: "PaperWhiteRatio", linkageName: "\01?PaperWhiteRatio@CB0@@3MB", scope: !0, file: !1, line: 22, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!51 = !DIGlobalVariable(name: "MaxBrightness", linkageName: "\01?MaxBrightness@CB0@@3MB", scope: !0, file: !1, line: 23, type: !50, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariable(name: "MainBuffer", linkageName: "\01?MainBuffer@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 17, type: !53, isLocal: false, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 17, size: 128, align: 32, elements: !2, templateParams: !54)
!54 = !{!55}
!55 = !DITemplateTypeParameter(name: "element", type: !18)
!56 = !DIGlobalVariable(name: "OverlayBuffer", linkageName: "\01?OverlayBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 18, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 18, size: 160, align: 32, elements: !2, templateParams: !58)
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "element", type: !28)
!60 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !47, file: !43, line: 122, type: !61, isLocal: false, isDefinition: true)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 122, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 122, size: 288, align: 32, elements: !64, templateParams: !74)
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !63, file: !1, line: 122, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !63, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !63, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !63, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !63, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !63, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !63, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !63, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !63, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!74 = !{!25, !75, !76}
!75 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 3)
!76 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 3)
!77 = !{i32 2, !"Dwarf Version", i32 4}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!80 = !{!"Shaders\5CCompositeHDRPS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#include \22ToneMappingUtility.hlsli\22\0D\0A#include \22PresentRS.hlsli\22\0D\0A\0D\0ATexture2D<float3> MainBuffer : register(t0);\0D\0ATexture2D<float4> OverlayBuffer : register(t1);\0D\0A\0D\0Acbuffer CB0 : register(b0)\0D\0A{\0D\0A    float PaperWhiteRatio; // PaperWhite / 10000.0\0D\0A    float MaxBrightness;\0D\0A}\0D\0A\0D\0A[RootSignature(Present_RootSig)]\0D\0Afloat3 main( float4 position : SV_Position, float2 uv : TexCoord0 ) : SV_Target0\0D\0A{\0D\0A    int2 ST = (int2)position.xy;\0D\0A\0D\0A    float3 MainColor = ApplyREC2084Curve(MainBuffer[ST] / 10000.0);\0D\0A\0D\0A    float4 OverlayColor = OverlayBuffer[ST];\0D\0A\0D\0A    OverlayColor.rgb = RemoveSRGBCurve(OverlayColor.rgb);\0D\0A    OverlayColor.rgb = REC709toREC2020(OverlayColor.rgb / (OverlayColor.a == 0.0 ? 1.0 : OverlayColor.a));\0D\0A    OverlayColor.rgb = ApplyREC2084Curve(OverlayColor.rgb * PaperWhiteRatio);\0D\0A\0D\0A    return lerp(MainColor, OverlayColor.rgb, OverlayColor.a);\0D\0A}\0D\0A"}
