#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 5b7eca4156d3dfee163a9b4bf2474ace.pdb
; shader hash: 5b7eca4156d3dfee163a9b4bf2474ace
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float FocusCenter;                            ; Offset:    0
;       float FocalSpread;                            ; Offset:    4
;       float FocalMinDist;                           ; Offset:    8
;       float FocalMaxDist;                           ; Offset:   12
;       float2 RcpBufferDim;                          ; Offset:   16
;       uint2 FullDimension;                          ; Offset:   24
;       int2 HalfDimensionMinusOne;                   ; Offset:   32
;       uint2 TiledDimension;                         ; Offset:   40
;       float2 InvTiledDimension;                     ; Offset:   48
;       uint DebugMode;                               ; Offset:   56
;       uint DisablePreFilter;                        ; Offset:   60
;       float ForegroundRange;                        ; Offset:   64
;       float RcpForegroundRange;                     ; Offset:   68

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !63)
!1 = !DIFile(filename: "Shaders\5CDoFPass2FastCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !25}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 93, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 93, size: 128, align: 32, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 93, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 93, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 93, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 93, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 89, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 89, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 89, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 89, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 89, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!23, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!33 = !{!34, !44, !54, !58, !61, !62}
!34 = !DISubprogram(name: "main", scope: !1, file: !1, line: 69, type: !35, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !37}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 23, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 23, size: 96, align: 32, elements: !39, templateParams: !43)
!39 = !{!40, !41, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !{!11, !32}
!44 = !DISubprogram(name: "PrefetchPixel", linkageName: "\01?PrefetchPixel@@YAXV?$vector@H$01@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 25, type: !45, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !47, !4}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 30, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !49, templateParams: !52)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !48, file: !1, line: 30, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !48, file: !1, line: 30, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !{!53, !12}
!53 = !DITemplateTypeParameter(name: "element", type: !13)
!54 = !DISubprogram(name: "LoadColor", linkageName: "\01?LoadColor@@YA?AV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 34, type: !55, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!25, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 33, baseType: !8)
!58 = !DISubprogram(name: "AccumulateOneRing", linkageName: "\01?AccumulateOneRing@@YA?AV?$vector@M$03@@I@Z", scope: !1, file: !1, line: 40, type: !59, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!14, !57}
!61 = !DISubprogram(name: "AccumulateTwoRings", linkageName: "\01?AccumulateTwoRings@@YA?AV?$vector@M$03@@I@Z", scope: !1, file: !1, line: 49, type: !59, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubprogram(name: "AccumulateThreeRings", linkageName: "\01?AccumulateThreeRings@@YA?AV?$vector@M$03@@I@Z", scope: !1, file: !1, line: 58, type: !59, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!63 = !{!64, !67, !68, !69, !70, !78, !80, !82, !83, !84, !86, !87, !88, !89, !90, !94, !96, !98, !99, !100, !104, !108, !112, !115, !117, !119, !123, !124, !127, !129}
!64 = !DIGlobalVariable(name: "FocusCenter", linkageName: "\01?FocusCenter@CB0@@3MB", scope: !0, file: !65, line: 24, type: !66, isLocal: false, isDefinition: true)
!65 = !DIFile(filename: "Shaders/DoFCommon.hlsli", directory: "")
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!67 = !DIGlobalVariable(name: "FocalSpread", linkageName: "\01?FocalSpread@CB0@@3MB", scope: !0, file: !65, line: 25, type: !66, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "FocalMinDist", linkageName: "\01?FocalMinDist@CB0@@3MB", scope: !0, file: !65, line: 26, type: !66, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "FocalMaxDist", linkageName: "\01?FocalMaxDist@CB0@@3MB", scope: !0, file: !65, line: 27, type: !66, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariable(name: "RcpBufferDim", linkageName: "\01?RcpBufferDim@CB0@@3V?$vector@M$01@@B", scope: !0, file: !65, line: 28, type: !71, isLocal: false, isDefinition: true)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 28, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 28, size: 64, align: 32, elements: !74, templateParams: !77)
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !73, file: !1, line: 28, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !73, file: !1, line: 28, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!77 = !{!23, !12}
!78 = !DIGlobalVariable(name: "FullDimension", linkageName: "\01?FullDimension@CB0@@3V?$vector@I$01@@B", scope: !0, file: !65, line: 29, type: !79, isLocal: false, isDefinition: true)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!80 = !DIGlobalVariable(name: "HalfDimensionMinusOne", linkageName: "\01?HalfDimensionMinusOne@CB0@@3V?$vector@H$01@@B", scope: !0, file: !65, line: 30, type: !81, isLocal: false, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!82 = !DIGlobalVariable(name: "TiledDimension", linkageName: "\01?TiledDimension@CB0@@3V?$vector@I$01@@B", scope: !0, file: !65, line: 31, type: !79, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariable(name: "InvTiledDimension", linkageName: "\01?InvTiledDimension@CB0@@3V?$vector@M$01@@B", scope: !0, file: !65, line: 32, type: !71, isLocal: false, isDefinition: true)
!84 = !DIGlobalVariable(name: "DebugMode", linkageName: "\01?DebugMode@CB0@@3IB", scope: !0, file: !65, line: 33, type: !85, isLocal: false, isDefinition: true)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!86 = !DIGlobalVariable(name: "DisablePreFilter", linkageName: "\01?DisablePreFilter@CB0@@3IB", scope: !0, file: !65, line: 34, type: !85, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariable(name: "ForegroundRange", linkageName: "\01?ForegroundRange@CB0@@3MB", scope: !0, file: !65, line: 35, type: !66, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariable(name: "RcpForegroundRange", linkageName: "\01?RcpForegroundRange@CB0@@3MB", scope: !0, file: !65, line: 36, type: !66, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "AntiSparkleFilterStrength", linkageName: "\01?AntiSparkleFilterStrength@CB0@@3MB", scope: !0, file: !65, line: 37, type: !66, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "gs_RB", linkageName: "\01?gs_RB@@3PAIA", scope: !0, file: !1, line: 22, type: !91, isLocal: false, isDefinition: true, variable: [576 x i32] addrspace(3)* @"\01?gs_RB@@3PAIA")
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 18432, align: 32, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 576)
!94 = !DIGlobalVariable(name: "gs_Gr", linkageName: "\01?gs_Gr@@3PAMA", scope: !0, file: !1, line: 23, type: !95, isLocal: false, isDefinition: true, variable: [576 x float] addrspace(3)* @"\01?gs_Gr@@3PAMA")
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 18432, align: 32, elements: !92)
!96 = !DIGlobalVariable(name: "PointSampler", linkageName: "\01?PointSampler@@3USamplerState@@A", scope: !0, file: !65, line: 18, type: !97, isLocal: false, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 18, size: 32, align: 32, elements: !2)
!98 = !DIGlobalVariable(name: "ClampSampler", linkageName: "\01?ClampSampler@@3USamplerState@@A", scope: !0, file: !65, line: 19, type: !97, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariable(name: "BilinearSampler", linkageName: "\01?BilinearSampler@@3USamplerState@@A", scope: !0, file: !65, line: 20, type: !97, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariable(name: "s_Ring1", scope: !0, file: !65, line: 94, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 512, align: 32, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 8)
!104 = !DIGlobalVariable(name: "s_Ring2", scope: !0, file: !65, line: 102, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 1024, align: 32, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 16)
!108 = !DIGlobalVariable(name: "s_Ring3", scope: !0, file: !65, line: 114, type: !109, isLocal: true, isDefinition: true)
