#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 1db82225226774689c0f70e5e00fb03d.pdb
; shader hash: 1db82225226774689c0f70e5e00fb03d
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float2 kRcpScale;                             ; Offset:    0
;   
;   } CB0;                                            ; Offset:    0 Size:     8
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CB0                               cbuffer      NA          NA     CB0            cb0     1
; Source                            texture     f32          2d      T0             t0     1
; Dest                                  UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%dx.types.Handle = type { i8* }
%dx.types.CBufRet.f32 = type { float, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !48, globals: !112)
!1 = !DIFile(filename: "Shaders\5CLanczosFast24CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !29, !30}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 24, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 24, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 78, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 78, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 78, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 78, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 81, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 81, size: 64, align: 32, elements: !24, templateParams: !27)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 81, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 81, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !{!28, !12}
!28 = !DITemplateTypeParameter(name: "element", type: !13)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 49, baseType: !18)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x4", file: !1, line: 21, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 4>", file: !1, line: 21, size: 384, align: 32, elements: !32, templateParams: !45)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!45 = !{!11, !46, !47}
!46 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!47 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!48 = !{!49, !61, !71, !84, !85, !88, !91, !94, !98, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!49 = !DISubprogram(name: "main", scope: !50, file: !50, line: 71, type: !51, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!50 = !DIFile(filename: "Shaders/LanczosCS.hlsl", directory: "")
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53, !53, !53, !29}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 49, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 49, size: 96, align: 32, elements: !55, templateParams: !59)
!55 = !{!56, !57, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !54, file: !1, line: 49, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !54, file: !1, line: 49, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !54, file: !1, line: 49, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!59 = !{!21, !60}
!60 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!61 = !DISubprogram(name: "StoreLDS", linkageName: "\01?StoreLDS@@YAXIV?$vector@M$02@@@Z", scope: !50, file: !50, line: 52, type: !62, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !29, !64}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 129, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 129, size: 96, align: 32, elements: !66, templateParams: !70)
!66 = !{!67, !68, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !65, file: !1, line: 129, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !65, file: !1, line: 129, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !65, file: !1, line: 129, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!70 = !{!11, !60}
!71 = !DISubprogram(name: "GetUpscaleFilterWeights", linkageName: "\01?GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z", scope: !72, file: !72, line: 39, type: !73, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DIFile(filename: "Shaders/LanczosFunctions.hlsli", directory: "")
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !8}
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 104, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 104, size: 128, align: 32, elements: !77, templateParams: !82)
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !76, file: !1, line: 104, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !76, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !76, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !76, file: !1, line: 104, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!82 = !{!11, !83}
!83 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!84 = !DISubprogram(name: "ComputeWeights", linkageName: "\01?ComputeWeights@@YA?AV?$vector@M$03@@M@Z", scope: !72, file: !72, line: 29, type: !73, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubprogram(name: "Lanczos", linkageName: "\01?Lanczos@@YAMMM@Z", scope: !72, file: !72, line: 23, type: !86, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false)
!86 = !DISubroutineType(types: !87)
!87 = !{!8, !8, !8}
!88 = !DISubprogram(name: "Sinc", linkageName: "\01?Sinc@@YAMM@Z", scope: !72, file: !72, line: 15, type: !89, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{!8, !8}
!91 = !DISubprogram(name: "LoadSamples", linkageName: "\01?LoadSamples@@YA?AV?$matrix@M$02$03@@II@Z", scope: !50, file: !50, line: 60, type: !92, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{!30, !29, !29}
!94 = !DISubprogram(name: "RemoveDisplayProfile", linkageName: "\01?RemoveDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !95, file: !95, line: 114, type: !96, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!96 = !DISubroutineType(types: !97)
!97 = !{!64, !64, !13}
!98 = !DISubprogram(name: "RemoveSRGBCurve", linkageName: "\01?RemoveSRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !99, file: !99, line: 43, type: !100, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!99 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!100 = !DISubroutineType(types: !101)
!101 = !{!64, !64}
!102 = !DISubprogram(name: "RGBLimitedToFull10bit", linkageName: "\01?RGBLimitedToFull10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !95, file: !95, line: 76, type: !100, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubprogram(name: "RemoveREC709Curve", linkageName: "\01?RemoveREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !99, file: !99, line: 68, type: !100, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubprogram(name: "REC2020toREC709", linkageName: "\01?REC2020toREC709@@YA?AV?$vector@M$02@@V1@@Z", scope: !99, file: !99, line: 131, type: !100, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!105 = !DISubprogram(name: "RemoveREC2084Curve", linkageName: "\01?RemoveREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !99, file: !99, line: 86, type: !100, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false)
!106 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !95, file: !95, line: 94, type: !96, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !99, file: !99, line: 37, type: !100, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!108 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !95, file: !95, line: 71, type: !100, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !99, file: !99, line: 63, type: !100, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!110 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !99, file: !99, line: 75, type: !100, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!111 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !99, file: !99, line: 120, type: !100, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!112 = !{!113, !115, !119, !120, !121, !125, !127, !132, !134, !136, !138, !140, !142, !158}
!113 = !DIGlobalVariable(name: "kRcpScale", linkageName: "\01?kRcpScale@CB0@@3V?$vector@M$01@@B", scope: !0, file: !50, line: 24, type: !114, isLocal: false, isDefinition: true)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!115 = !DIGlobalVariable(name: "g_R", linkageName: "\01?g_R@@3PAMA", scope: !0, file: !50, line: 47, type: !116, isLocal: false, isDefinition: true, variable: [768 x float] addrspace(3)* @"\01?g_R@@3PAMA")
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 24576, align: 32, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 768)
!119 = !DIGlobalVariable(name: "g_G", linkageName: "\01?g_G@@3PAMA", scope: !0, file: !50, line: 48, type: !116, isLocal: false, isDefinition: true, variable: [768 x float] addrspace(3)* @"\01?g_G@@3PAMA")
!120 = !DIGlobalVariable(name: "g_B", linkageName: "\01?g_B@@3PAMA", scope: !0, file: !50, line: 49, type: !116, isLocal: false, isDefinition: true, variable: [768 x float] addrspace(3)* @"\01?g_B@@3PAMA")
!121 = !DIGlobalVariable(name: "Source", linkageName: "\01?Source@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !50, line: 19, type: !122, isLocal: false, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 19, size: 128, align: 32, elements: !2, templateParams: !123)
!123 = !{!124}
!124 = !DITemplateTypeParameter(name: "element", type: !65)
!125 = !DIGlobalVariable(name: "Dest", linkageName: "\01?Dest@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !50, line: 20, type: !126, isLocal: false, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 3> >", file: !1, line: 20, size: 96, align: 32, elements: !2, templateParams: !123)
!127 = !DIGlobalVariable(name: "FilterWeights", scope: !71, file: !72, line: 44, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 2048, align: 32, elements: !130)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!130 = !{!131}
!131 = !DISubrange(count: 16)
!132 = !DIGlobalVariable(name: "M_PI", scope: !85, file: !72, line: 25, type: !133, isLocal: true, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!134 = !DIGlobalVariable(name: "FilterWeights.0", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.0", scope: !71, file: !72, line: 44, type: !135, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.0")
!135 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !128, size: 512, align: 4)
!136 = !DIGlobalVariable(name: "FilterWeights.1", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.1", scope: !71, file: !72, line: 44, type: !137, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.1")
!137 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !128, size: 512, align: 4, offset: 512)
!138 = !DIGlobalVariable(name: "FilterWeights.2", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.2", scope: !71, file: !72, line: 44, type: !139, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.2")
!139 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !128, size: 512, align: 4, offset: 1024)
!140 = !DIGlobalVariable(name: "FilterWeights.3", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.3", scope: !71, file: !72, line: 44, type: !141, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.3")
!141 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !128, size: 512, align: 4, offset: 1536)
!142 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC2020toREC709@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !104, file: !99, line: 133, type: !143, isLocal: false, isDefinition: true)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 133, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 133, size: 288, align: 32, elements: !146, templateParams: !156)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !145, file: !1, line: 133, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !145, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !145, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !145, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !145, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !145, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !145, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !145, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !145, file: !1, line: 133, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!156 = !{!11, !46, !157}
!157 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!158 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !111, file: !99, line: 122, type: !143, isLocal: false, isDefinition: true)
!159 = !{i32 2, !"Dwarf Version", i32 4}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!162 = !{!"Shaders\5CLanczosFast24CS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// The \22fast path\22 Lanczos filter can be used when the source tile dimensions\0D\0A// plus the border pixels (3) fit inside 16x16.  This reduces bandwidth and\0D\0A// uses more efficient Math.  To determine this case, use the following logic:\0D\0A// \0D\0A// bool EnableFastPath = all(srcDim.xy / dstDim.xy <= 21.0 / 24.0);\0D\0A//\0D\0A\0D\0A#define TILE_DIM_X 32\0D\0A#define TILE_DIM_Y 24\0D\0A#define ENABLE_FAST_PATH 1\0D\0A#include \22LanczosCS.hlsl\22\0D\0A"}
