#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   x   
; TexCoord                 0   xy          1     NONE   float    y  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: d9871f091b58f100bcb184f95855913b.pdb
; shader hash: d9871f091b58f100bcb184f95855913b
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float2 kSrcResolution;                        ; Offset:    0
;   
;   } CB0;                                            ; Offset:    0 Size:     8
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !42, globals: !102)
!1 = !DIFile(filename: "Shaders\5CLanczosVerticalPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !21, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 42, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 42, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 42, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 42, size: 64, align: 32, elements: !16, templateParams: !19)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 42, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 42, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !13)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 63, baseType: !8)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 42, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 42, size: 384, align: 32, elements: !24, templateParams: !38)
!24 = !{!25, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !23, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!38 = !{!39, !40, !41}
!39 = !DITemplateTypeParameter(name: "element", type: !26)
!40 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!41 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!42 = !{!43, !70, !74, !75, !78, !81, !84, !88, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!43 = !DISubprogram(name: "main", scope: !44, file: !44, line: 33, type: !45, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!44 = !DIFile(filename: "Shaders/LanczosHorizontalPS.hlsl", directory: "")
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !55, !64}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 23, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 23, size: 96, align: 32, elements: !49, templateParams: !53)
!49 = !{!50, !51, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !48, file: !1, line: 23, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !48, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !48, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!53 = !{!39, !54}
!54 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 23, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 23, size: 128, align: 32, elements: !57, templateParams: !62)
!57 = !{!58, !59, !60, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !56, file: !1, line: 23, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !56, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !56, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !56, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!62 = !{!39, !63}
!63 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 23, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 23, size: 64, align: 32, elements: !66, templateParams: !69)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !65, file: !1, line: 23, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !65, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!69 = !{!39, !12}
!70 = !DISubprogram(name: "GetUpscaleFilterWeights", linkageName: "\01?GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z", scope: !71, file: !71, line: 39, type: !72, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DIFile(filename: "Shaders/LanczosFunctions.hlsli", directory: "")
!72 = !DISubroutineType(types: !73)
!73 = !{!55, !26}
!74 = !DISubprogram(name: "ComputeWeights", linkageName: "\01?ComputeWeights@@YA?AV?$vector@M$03@@M@Z", scope: !71, file: !71, line: 29, type: !72, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubprogram(name: "Lanczos", linkageName: "\01?Lanczos@@YAMMM@Z", scope: !71, file: !71, line: 23, type: !76, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!26, !26, !26}
!78 = !DISubprogram(name: "Sinc", linkageName: "\01?Sinc@@YAMM@Z", scope: !71, file: !71, line: 15, type: !79, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!26, !26}
!81 = !DISubprogram(name: "LoadSamples", linkageName: "\01?LoadSamples@@YA?AV?$matrix@M$03$02@@V?$vector@H$01@@V?$vector@I$01@@@Z", scope: !44, file: !44, line: 26, type: !82, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!22, !14, !4}
!84 = !DISubprogram(name: "RemoveDisplayProfile", linkageName: "\01?RemoveDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !85, file: !85, line: 114, type: !86, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!86 = !DISubroutineType(types: !87)
!87 = !{!47, !47, !13}
!88 = !DISubprogram(name: "RemoveSRGBCurve", linkageName: "\01?RemoveSRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !89, file: !89, line: 43, type: !90, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!90 = !DISubroutineType(types: !91)
!91 = !{!47, !47}
!92 = !DISubprogram(name: "RGBLimitedToFull10bit", linkageName: "\01?RGBLimitedToFull10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !85, file: !85, line: 76, type: !90, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!93 = !DISubprogram(name: "RemoveREC709Curve", linkageName: "\01?RemoveREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !89, file: !89, line: 68, type: !90, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DISubprogram(name: "REC2020toREC709", linkageName: "\01?REC2020toREC709@@YA?AV?$vector@M$02@@V1@@Z", scope: !89, file: !89, line: 131, type: !90, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubprogram(name: "RemoveREC2084Curve", linkageName: "\01?RemoveREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !89, file: !89, line: 86, type: !90, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false)
!96 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !85, file: !85, line: 94, type: !86, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !89, file: !89, line: 37, type: !90, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !85, file: !85, line: 71, type: !90, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!99 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !89, file: !89, line: 63, type: !90, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !89, file: !89, line: 75, type: !90, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!101 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !89, file: !89, line: 120, type: !90, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!102 = !{!103, !105, !109, !114, !116, !118, !120, !122, !124, !140}
!103 = !DIGlobalVariable(name: "kSrcResolution", linkageName: "\01?kSrcResolution@CB0@@3V?$vector@M$01@@B", scope: !0, file: !44, line: 23, type: !104, isLocal: false, isDefinition: true)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!105 = !DIGlobalVariable(name: "Source", linkageName: "\01?Source@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !44, line: 19, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 19, size: 128, align: 32, elements: !2, templateParams: !107)
!107 = !{!108}
!108 = !DITemplateTypeParameter(name: "element", type: !48)
!109 = !DIGlobalVariable(name: "FilterWeights", scope: !70, file: !71, line: 44, type: !110, isLocal: true, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 2048, align: 32, elements: !112)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!112 = !{!113}
!113 = !DISubrange(count: 16)
!114 = !DIGlobalVariable(name: "M_PI", scope: !75, file: !71, line: 25, type: !115, isLocal: true, isDefinition: true)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!116 = !DIGlobalVariable(name: "FilterWeights.0", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.0", scope: !70, file: !71, line: 44, type: !117, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.0")
!117 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !110, size: 512, align: 4)
!118 = !DIGlobalVariable(name: "FilterWeights.1", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.1", scope: !70, file: !71, line: 44, type: !119, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.1")
!119 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !110, size: 512, align: 4, offset: 512)
!120 = !DIGlobalVariable(name: "FilterWeights.2", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.2", scope: !70, file: !71, line: 44, type: !121, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.2")
!121 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !110, size: 512, align: 4, offset: 1024)
!122 = !DIGlobalVariable(name: "FilterWeights.3", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.3", scope: !70, file: !71, line: 44, type: !123, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.3")
!123 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !110, size: 512, align: 4, offset: 1536)
!124 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC2020toREC709@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !94, file: !89, line: 133, type: !125, isLocal: false, isDefinition: true)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 133, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 133, size: 288, align: 32, elements: !128, templateParams: !138)
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !127, file: !1, line: 133, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !127, file: !1, line: 133, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !127, file: !1, line: 133, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !127, file: !1, line: 133, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !127, file: !1, line: 133, baseType: !26, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !127, file: !1, line: 133, baseType: !26, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !127, file: !1, line: 133, baseType: !26, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !127, file: !1, line: 133, baseType: !26, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !127, file: !1, line: 133, baseType: !26, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!138 = !{!39, !139, !41}
!139 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!140 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !101, file: !89, line: 122, type: !125, isLocal: false, isDefinition: true)
!141 = !{i32 2, !"Dwarf Version", i32 4}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!144 = !{!"Shaders\5CLanczosVerticalPS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A\0D\0A#define LANCZOS_VERTICAL 1\0D\0A#include \22LanczosHorizontalPS.hlsl\22\0D\0A"}
