#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
; SV_InstanceID            0   x           1   INSTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; TEXCOORD                 1   x           2     NONE    uint   x   
; TEXCOORD                 3    y          2     NONE   float    y  
; TEXCOORD                 2   xyzw        3     NONE   float   xyzw
;
; shader debug name: 5e21bf65c7cab9a71703d5634561d9a1.pdb
; shader hash: 5e21bf65c7cab9a71703d5634561d9a1
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
; SV_InstanceID            0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !60)
!1 = !DIFile(filename: "Shaders\5CParticleVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !37}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 17, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 17, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 17, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 34, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 34, size: 288, align: 32, elements: !24, templateParams: !34)
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !23, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !23, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !23, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !23, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !23, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !23, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !23, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !23, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !23, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!34 = !{!11, !35, !36}
!35 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!36 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 48, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 48, size: 128, align: 32, elements: !39, templateParams: !44)
!39 = !{!40, !41, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, line: 48, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !38, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!44 = !{!11, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!46 = !{!47}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 20, type: !48, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !56, !56}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleVertexOutput", file: !51, line: 58, size: 384, align: 32, elements: !52)
!51 = !DIFile(filename: "Shaders/ParticleUpdateCommon.hlsli", directory: "")
!52 = !{!53, !54, !55, !58, !59}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", scope: !50, file: !51, line: 60, baseType: !37, size: 128, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !50, file: !51, line: 61, baseType: !4, size: 64, align: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "TexID", scope: !50, file: !51, line: 62, baseType: !56, size: 32, align: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !57)
!57 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !50, file: !51, line: 63, baseType: !37, size: 128, align: 32, offset: 224)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "LinearZ", scope: !50, file: !51, line: 64, baseType: !8, size: 32, align: 32, offset: 352)
!60 = !{!61, !63, !65, !66, !67, !68, !69, !70, !71, !72, !74, !75, !76, !77, !78, !92, !117, !118, !119, !120, !121, !122, !124, !125, !126, !127, !128, !129, !131, !132, !133, !143}
!61 = !DIGlobalVariable(name: "LastEmitPosW", linkageName: "\01?LastEmitPosW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !51, line: 17, type: !62, isLocal: false, isDefinition: true)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!63 = !DIGlobalVariable(name: "EmitSpeed", linkageName: "\01?EmitSpeed@EmissionProperties@@3MB", scope: !0, file: !51, line: 18, type: !64, isLocal: false, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!65 = !DIGlobalVariable(name: "EmitPosW", linkageName: "\01?EmitPosW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !51, line: 19, type: !62, isLocal: false, isDefinition: true)
!66 = !DIGlobalVariable(name: "FloorHeight", linkageName: "\01?FloorHeight@EmissionProperties@@3MB", scope: !0, file: !51, line: 20, type: !64, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariable(name: "EmitDirW", linkageName: "\01?EmitDirW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !51, line: 21, type: !62, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "Restitution", linkageName: "\01?Restitution@EmissionProperties@@3MB", scope: !0, file: !51, line: 22, type: !64, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "EmitRightW", linkageName: "\01?EmitRightW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !51, line: 23, type: !62, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariable(name: "EmitterVelocitySensitivity", linkageName: "\01?EmitterVelocitySensitivity@EmissionProperties@@3MB", scope: !0, file: !51, line: 24, type: !64, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariable(name: "EmitUpW", linkageName: "\01?EmitUpW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !51, line: 25, type: !62, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "MaxParticles", linkageName: "\01?MaxParticles@EmissionProperties@@3IB", scope: !0, file: !51, line: 26, type: !73, isLocal: false, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!74 = !DIGlobalVariable(name: "Gravity", linkageName: "\01?Gravity@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !51, line: 27, type: !62, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariable(name: "TextureID", linkageName: "\01?TextureID@EmissionProperties@@3IB", scope: !0, file: !51, line: 28, type: !73, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariable(name: "EmissiveColor", linkageName: "\01?EmissiveColor@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !51, line: 29, type: !62, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "pad", linkageName: "\01?pad@EmissionProperties@@3MB", scope: !0, file: !51, line: 30, type: !64, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariable(name: "RandIndex", linkageName: "\01?RandIndex@EmissionProperties@@3QBV?$vector@I$03@@B", scope: !0, file: !51, line: 31, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 8192, align: 32, elements: !90)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 31, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 31, size: 128, align: 32, elements: !83, templateParams: !88)
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !82, file: !1, line: 31, baseType: !57, size: 32, align: 32, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !82, file: !1, line: 31, baseType: !57, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !82, file: !1, line: 31, baseType: !57, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !82, file: !1, line: 31, baseType: !57, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!88 = !{!89, !45}
!89 = !DITemplateTypeParameter(name: "element", type: !57)
!90 = !{!91}
!91 = !DISubrange(count: 64)
!92 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !93, line: 34, type: !94, isLocal: false, isDefinition: true)
!93 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !97, templateParams: !114)
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !96, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!114 = !{!11, !115, !116}
!115 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!116 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!117 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !93, line: 35, type: !94, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !93, line: 37, type: !64, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !93, line: 38, type: !64, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !93, line: 39, type: !64, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !93, line: 40, type: !64, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !93, line: 42, type: !123, isLocal: false, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!124 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !93, line: 43, type: !123, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !93, line: 45, type: !73, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !93, line: 46, type: !73, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !93, line: 47, type: !73, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !93, line: 48, type: !73, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !93, line: 28, type: !130, isLocal: false, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!131 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !93, line: 29, type: !130, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !93, line: 30, type: !130, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariable(name: "g_VertexBuffer", linkageName: "\01?g_VertexBuffer@@3V?$StructuredBuffer@UParticleVertex@@@@A", scope: !0, file: !1, line: 16, type: !134, isLocal: false, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ParticleVertex>", file: !1, line: 16, size: 288, align: 32, elements: !2, templateParams: !135)
!135 = !{!136}
!136 = !DITemplateTypeParameter(name: "element", type: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleVertex", file: !93, line: 51, size: 288, align: 32, elements: !138)
!138 = !{!139, !140, !141, !142}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !137, file: !93, line: 53, baseType: !14, size: 96, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !137, file: !93, line: 54, baseType: !37, size: 128, align: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !137, file: !93, line: 55, baseType: !8, size: 32, align: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "TextureID", scope: !137, file: !93, line: 56, baseType: !56, size: 32, align: 32, offset: 256)
!143 = !DIGlobalVariable(name: "g_IndexBuffer", linkageName: "\01?g_IndexBuffer@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 17, type: !144, isLocal: false, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 17, size: 32, align: 32, elements: !2, templateParams: !145)
!145 = !{!89}
!146 = !{i32 2, !"Dwarf Version", i32 4}
!147 = !{i32 2, !"Debug Info Version", i32 3}
!148 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!149 = !{!"Shaders\5CParticleVS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):   James Stanard\0D\0A\0D\0A#include \22ParticleUpdateCommon.hlsli\22\0D\0A#include \22ParticleUtility.hlsli\22\0D\0A\0D\0AStructuredBuffer<ParticleVertex> g_VertexBuffer : register( t0 );\0D\0AStructuredBuffer<uint> g_IndexBuffer : register( t3 );\0D\0A\0D\0A[RootSignature(Particle_RootSig)]\0D\0AParticleVertexOutput main( uint BillboardVertex : SV_VertexID, uint InstanceId : SV_InstanceID )\0D\0A{\0D\0A#ifdef DISABLE_PARTICLE_SORT\0D\0A    ParticleVertex In = g_VertexBuffer[ InstanceId ];\0D\0A#else\0D\0A    ParticleVertex In = g_VertexBuffer[ g_IndexBuffer[InstanceId] & 0x3FFFF ];\0D\0A#endif\0D\0A    ParticleVertexOutput Out;\0D\0A\0D\0A    Out.TexCoord = float2((BillboardVertex >> 1) & 1, BillboardVertex & 1);\0D\0A    Out.Color = In.Color;\0D\0A    Out.TexID = In.TextureID;\0D\0A\0D\0A    float2 Corner = lerp( float2(-1, 1), float2(1, -1), Out.TexCoord );\0D\0A    float3 Position = mul( (float3x3)gInvView, float3(Corner * In.Size, 0) ) + In.Position;\0D\0A\0D\0A    Out.Pos = mul( gViewProj, float4(Position, 1) );\0D\0A    Out.LinearZ = Out.Pos.w * gRcpFarZ;\0D\0A\0D\0A    return Out;\0D\0A}\0D\0A"}
!150 = !{!"Shaders\5CParticleRS.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard \0A//\0A\0A#define Particle_RootSig \5C\0A    \22RootFlags(0), \22 \5C\0A    \22RootConstants(b0, num32BitConstants = 3),\22 \5C\0A    \22CBV(b1),\22 \5C\0A    \22CBV(b2),\22 \5C\0A    \22DescriptorTable(UAV(u0, numDescriptors = 8)),\22 \5C\0A    \22DescriptorTable(SRV(t0, numDescriptors = 10)),\22 \5C\0A    \22StaticSampler(s0,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22borderColor = STATIC_BORDER_COLOR_TRANSPARENT_BLACK,\22 \5C\0A        \22filter = FILTER_MIN_MAG_LINEAR_MIP_POINT),\22 \5C\0A    \22StaticSampler(s1,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0A        \22borderColor = STATIC_BORDER_COLOR_TRANSPARENT_BLACK,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_POINT), \22 \5C\0A    \22StaticSampler(s2,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22filter = FILTER_MIN_MAG_MIP_POINT)\22\0A"}
