#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 55850ab3b50ac90f0c096e7e4c5766e1.pdb
; shader hash: 55850ab3b50ac90f0c096e7e4c5766e1
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_DispatchIndirectArgs                UAV    byte         r/w      U0             u0     1
; g_DrawIndirectArgs                    UAV    byte         r/w      U1             u1     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%dx.types.Handle = type { i8* }
%dx.types.ResRet.i32 = type { i32, i32, i32, i32, i32 }
%struct.RWByteAddressBuffer = type { i32 }

@dx.nothing.a = internal constant [1 x i32] zeroinitializer

define void @main() {
  %g_DrawIndirectArgs_UAV_rawbuf = call %dx.types.Handle @dx.op.createHandle(i32 57, i8 1, i32 1, i32 1, i1 false), !dbg !98 ; line:29 col:5  ; CreateHandle(resourceClass,rangeId,index,nonUniformIndex)

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !20)
!1 = !DIFile(filename: "Shaders\5CParticleSortIndirectArgsCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 26, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 26, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16}
!16 = !DISubprogram(name: "main", scope: !1, file: !1, line: 21, type: !17, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !8)
!20 = !{!21, !48, !49, !51, !52, !53, !54, !63, !64, !66, !67, !68, !69, !71, !72, !73, !75}
!21 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !22, line: 34, type: !23, isLocal: false, isDefinition: true)
!22 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !26, templateParams: !44)
!26 = !{!27, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !25, file: !1, line: 34, baseType: !28, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!44 = !{!45, !46, !47}
!45 = !DITemplateTypeParameter(name: "element", type: !28)
!46 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!47 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!48 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !22, line: 35, type: !23, isLocal: false, isDefinition: true)
!49 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !22, line: 37, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!51 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !22, line: 38, type: !50, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !22, line: 39, type: !50, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !22, line: 40, type: !50, isLocal: false, isDefinition: true)
!54 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !22, line: 42, type: !55, isLocal: false, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !58, templateParams: !61)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !57, file: !1, line: 42, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !57, file: !1, line: 42, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!61 = !{!45, !62}
!62 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!63 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !22, line: 43, type: !55, isLocal: false, isDefinition: true)
!64 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !22, line: 45, type: !65, isLocal: false, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!66 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !22, line: 46, type: !65, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !22, line: 47, type: !65, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !22, line: 48, type: !65, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !22, line: 28, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!71 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !22, line: 29, type: !70, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !22, line: 30, type: !70, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "g_DispatchIndirectArgs", linkageName: "\01?g_DispatchIndirectArgs@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 16, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 16, size: 32, align: 32, elements: !2)
!75 = !DIGlobalVariable(name: "g_DrawIndirectArgs", linkageName: "\01?g_DrawIndirectArgs@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 17, type: !74, isLocal: false, isDefinition: true)
!76 = !{i32 2, !"Dwarf Version", i32 4}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!79 = !{!"Shaders\5CParticleSortIndirectArgsCS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#include \22ParticleUtility.hlsli\22\0D\0A\0D\0ARWByteAddressBuffer g_DispatchIndirectArgs : register(u0);\0D\0ARWByteAddressBuffer g_DrawIndirectArgs : register(u1);\0D\0A\0D\0A[RootSignature(Particle_RootSig)]\0D\0A[numthreads(1, 1, 1)]\0D\0Avoid main( uint GI : SV_GroupIndex )\0D\0A{\0D\0A    uint InstanceCount = g_DrawIndirectArgs.Load(4);\0D\0A    uint ThreadGroupCount = (InstanceCount + 2047) / 2048;\0D\0A\0D\0A    g_DispatchIndirectArgs.Store3(0, uint3(ThreadGroupCount, 1, 1));\0D\0A\0D\0A    // Reset instance count so we can cull and determine how many we need to actually draw\0D\0A    g_DrawIndirectArgs.Store(4, 0);\0D\0A}\0D\0A"}
