#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 2dfb193bc428ff28f3f079f72f2da9a4.pdb
; shader hash: 2dfb193bc428ff28f3f079f72f2da9a4
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_FinalInstanceCounter            texture    byte         r/o      T0             t0     1
; g_NumThreadGroups                     UAV    byte         r/w      U0             u0     1
; g_DrawIndirectArgs                    UAV    byte         r/w      U1             u1     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%dx.types.Handle = type { i8* }
%dx.types.ResRet.i32 = type { i32, i32, i32, i32, i32 }
%struct.ByteAddressBuffer = type { i32 }
%struct.RWByteAddressBuffer = type { i32 }

@dx.nothing.a = internal constant [1 x i32] zeroinitializer

define void @main() {

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !19)
!1 = !DIFile(filename: "Shaders\5CParticleFinalDispatchIndirectArgsCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 48, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 48, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16}
!16 = !DISubprogram(name: "main", scope: !1, file: !1, line: 22, type: !17, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !4}
!19 = !{!20, !47, !48, !50, !51, !52, !53, !62, !63, !66, !67, !68, !69, !71, !72, !73, !75, !77}
!20 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !21, line: 34, type: !22, isLocal: false, isDefinition: true)
!21 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !25, templateParams: !43)
!25 = !{!26, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !24, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!43 = !{!44, !45, !46}
!44 = !DITemplateTypeParameter(name: "element", type: !27)
!45 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!46 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!47 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !21, line: 35, type: !22, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !21, line: 37, type: !49, isLocal: false, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!50 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !21, line: 38, type: !49, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !21, line: 39, type: !49, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !21, line: 40, type: !49, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !21, line: 42, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !57, templateParams: !60)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !56, file: !1, line: 42, baseType: !27, size: 32, align: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !56, file: !1, line: 42, baseType: !27, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!60 = !{!44, !61}
!61 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!62 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !21, line: 43, type: !54, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !21, line: 45, type: !64, isLocal: false, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !8)
!66 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !21, line: 46, type: !64, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !21, line: 47, type: !64, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !21, line: 48, type: !64, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !21, line: 28, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!71 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !21, line: 29, type: !70, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !21, line: 30, type: !70, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "g_FinalInstanceCounter", linkageName: "\01?g_FinalInstanceCounter@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 16, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 16, size: 32, align: 32, elements: !2)
!75 = !DIGlobalVariable(name: "g_NumThreadGroups", linkageName: "\01?g_NumThreadGroups@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 17, type: !76, isLocal: false, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 17, size: 32, align: 32, elements: !2)
!77 = !DIGlobalVariable(name: "g_DrawIndirectArgs", linkageName: "\01?g_DrawIndirectArgs@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 18, type: !76, isLocal: false, isDefinition: true)
!78 = !{i32 2, !"Dwarf Version", i32 4}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
