#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xy  
; TEXCOORD                 0   xy          1     NONE   float   xy  
; TEXCOORD                 1   x           2     NONE    uint   x   
; TEXCOORD                 3    y          2     NONE   float    y  
; TEXCOORD                 2   xyzw        3     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: b7d5a4cadecc77f5c44f7d866e721e6a.pdb
; shader hash: b7d5a4cadecc77f5c44f7d866e721e6a
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; TEXCOORD                 1        nointerpolation       
; TEXCOORD                 2        nointerpolation       
; TEXCOORD                 3        nointerpolation       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !52)
!1 = !DIFile(filename: "Shaders\5CParticlePS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 17, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 17, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 26, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 26, size: 64, align: 32, elements: !17, templateParams: !21)
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 26, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 26, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !19)
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!24 = !{!25}
!25 = !DISubprogram(name: "main", scope: !1, file: !1, line: 22, type: !26, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !37}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 48, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 48, size: 128, align: 32, elements: !30, templateParams: !35)
!30 = !{!31, !32, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, line: 48, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !29, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !29, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!35 = !{!12, !36}
!36 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleVertexOutput", file: !38, line: 58, size: 384, align: 32, elements: !39)
!38 = !DIFile(filename: "Shaders/ParticleUpdateCommon.hlsli", directory: "")
!39 = !{!40, !41, !48, !50, !51}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", scope: !37, file: !38, line: 60, baseType: !28, size: 128, align: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !37, file: !38, line: 61, baseType: !42, size: 64, align: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !44, templateParams: !47)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !43, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !43, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!47 = !{!12, !23}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "TexID", scope: !37, file: !38, line: 62, baseType: !49, size: 32, align: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !19)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !37, file: !38, line: 63, baseType: !28, size: 128, align: 32, offset: 224)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "LinearZ", scope: !37, file: !38, line: 64, baseType: !8, size: 32, align: 32, offset: 352)
!52 = !{!53, !55, !57, !58, !59, !60, !61, !62, !63, !64, !66, !67, !68, !69, !70, !83, !108, !109, !110, !111, !112, !113, !115, !116, !117, !118, !119, !120, !122, !123, !124, !128}
!53 = !DIGlobalVariable(name: "LastEmitPosW", linkageName: "\01?LastEmitPosW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !38, line: 17, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!55 = !DIGlobalVariable(name: "EmitSpeed", linkageName: "\01?EmitSpeed@EmissionProperties@@3MB", scope: !0, file: !38, line: 18, type: !56, isLocal: false, isDefinition: true)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!57 = !DIGlobalVariable(name: "EmitPosW", linkageName: "\01?EmitPosW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !38, line: 19, type: !54, isLocal: false, isDefinition: true)
!58 = !DIGlobalVariable(name: "FloorHeight", linkageName: "\01?FloorHeight@EmissionProperties@@3MB", scope: !0, file: !38, line: 20, type: !56, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariable(name: "EmitDirW", linkageName: "\01?EmitDirW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !38, line: 21, type: !54, isLocal: false, isDefinition: true)
!60 = !DIGlobalVariable(name: "Restitution", linkageName: "\01?Restitution@EmissionProperties@@3MB", scope: !0, file: !38, line: 22, type: !56, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariable(name: "EmitRightW", linkageName: "\01?EmitRightW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !38, line: 23, type: !54, isLocal: false, isDefinition: true)
!62 = !DIGlobalVariable(name: "EmitterVelocitySensitivity", linkageName: "\01?EmitterVelocitySensitivity@EmissionProperties@@3MB", scope: !0, file: !38, line: 24, type: !56, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariable(name: "EmitUpW", linkageName: "\01?EmitUpW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !38, line: 25, type: !54, isLocal: false, isDefinition: true)
!64 = !DIGlobalVariable(name: "MaxParticles", linkageName: "\01?MaxParticles@EmissionProperties@@3IB", scope: !0, file: !38, line: 26, type: !65, isLocal: false, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!66 = !DIGlobalVariable(name: "Gravity", linkageName: "\01?Gravity@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !38, line: 27, type: !54, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariable(name: "TextureID", linkageName: "\01?TextureID@EmissionProperties@@3IB", scope: !0, file: !38, line: 28, type: !65, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "EmissiveColor", linkageName: "\01?EmissiveColor@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !38, line: 29, type: !54, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "pad", linkageName: "\01?pad@EmissionProperties@@3MB", scope: !0, file: !38, line: 30, type: !56, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariable(name: "RandIndex", linkageName: "\01?RandIndex@EmissionProperties@@3QBV?$vector@I$03@@B", scope: !0, file: !38, line: 31, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 8192, align: 32, elements: !81)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 31, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 31, size: 128, align: 32, elements: !75, templateParams: !80)
!75 = !{!76, !77, !78, !79}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !74, file: !1, line: 31, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !74, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !74, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !74, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!80 = !{!22, !36}
!81 = !{!82}
!82 = !DISubrange(count: 64)
!83 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !84, line: 34, type: !85, isLocal: false, isDefinition: true)
!84 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !88, templateParams: !105)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !87, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!105 = !{!12, !106, !107}
!106 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!107 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!108 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !84, line: 35, type: !85, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !84, line: 37, type: !56, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !84, line: 38, type: !56, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !84, line: 39, type: !56, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !84, line: 40, type: !56, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !84, line: 42, type: !114, isLocal: false, isDefinition: true)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!115 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !84, line: 43, type: !114, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !84, line: 45, type: !65, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !84, line: 46, type: !65, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !84, line: 47, type: !65, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !84, line: 48, type: !65, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !84, line: 28, type: !121, isLocal: false, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!122 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !84, line: 29, type: !121, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !84, line: 30, type: !121, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariable(name: "ColorTex", linkageName: "\01?ColorTex@@3V?$Texture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 18, type: !125, isLocal: false, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2DArray<vector<float, 4> >", file: !1, line: 18, size: 160, align: 32, elements: !2, templateParams: !126)
!126 = !{!127}
!127 = !DITemplateTypeParameter(name: "element", type: !29)
!128 = !DIGlobalVariable(name: "LinearDepthTex", linkageName: "\01?LinearDepthTex@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 19, type: !129, isLocal: false, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 19, size: 64, align: 32, elements: !2, templateParams: !130)
!130 = !{!12}
!131 = !{i32 2, !"Dwarf Version", i32 4}
!132 = !{i32 2, !"Debug Info Version", i32 3}
