#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 85c79155cc9c90b7dd6d862d829255d4.pdb
; shader hash: 85c79155cc9c90b7dd6d862d829255d4
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CBChangesPerView
; {
;
;   struct hostlayout.CBChangesPerView
;   {
;
;       column_major float4x4 gInvView;               ; Offset:    0
;       column_major float4x4 gViewProj;              ; Offset:   64
;       float gVertCotangent;                         ; Offset:  128
;       float gAspectRatio;                           ; Offset:  132
;       float gRcpFarZ;                               ; Offset:  136
;       float gInvertZ;                               ; Offset:  140
;       float2 gBufferDim;                            ; Offset:  144
;       float2 gRcpBufferDim;                         ; Offset:  152
;       uint gBinsPerRow;                             ; Offset:  160
;       uint gTileRowPitch;                           ; Offset:  164
;       uint gTilesPerRow;                            ; Offset:  168
;       uint gTilesPerCol;                            ; Offset:  172
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !50)
!1 = !DIFile(filename: "Shaders\5CParticleLargeBinCullingCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !8, !24, !31}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 42, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 42, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 42, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 42, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 27, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 27, size: 64, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 27, baseType: !35, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 27, baseType: !35, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !{!38, !30}
!38 = !DITemplateTypeParameter(name: "element", type: !35)
!39 = !{!40}
!40 = !DISubprogram(name: "main", scope: !1, file: !1, line: 32, type: !41, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !43}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 27, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 27, size: 96, align: 32, elements: !45, templateParams: !49)
!45 = !{!46, !47, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !44, file: !1, line: 27, baseType: !35, size: 32, align: 32, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !44, file: !1, line: 27, baseType: !35, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !44, file: !1, line: 27, baseType: !35, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!49 = !{!38, !23}
!50 = !{!51, !76, !77, !79, !80, !81, !82, !84, !85, !88, !89, !90, !91, !93, !95, !96, !97, !107, !109, !112, !114}
!51 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !52, line: 34, type: !53, isLocal: false, isDefinition: true)
!52 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !56, templateParams: !73)
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !55, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!73 = !{!13, !74, !75}
!74 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!75 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!76 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !52, line: 35, type: !53, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !52, line: 37, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!79 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !52, line: 38, type: !78, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !52, line: 39, type: !78, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !52, line: 40, type: !78, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !52, line: 42, type: !83, isLocal: false, isDefinition: true)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!84 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !52, line: 43, type: !83, isLocal: false, isDefinition: true)
!85 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !52, line: 45, type: !86, isLocal: false, isDefinition: true)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !35)
!88 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !52, line: 46, type: !86, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !52, line: 47, type: !86, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !52, line: 48, type: !86, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "LogTilesPerLargeBin", linkageName: "\01?LogTilesPerLargeBin@CB0@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 27, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!93 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !52, line: 28, type: !94, isLocal: false, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!95 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !52, line: 29, type: !94, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !52, line: 30, type: !94, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariable(name: "g_VertexBuffer", linkageName: "\01?g_VertexBuffer@@3V?$StructuredBuffer@UParticleVertex@@@@A", scope: !0, file: !1, line: 19, type: !98, isLocal: false, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ParticleVertex>", file: !1, line: 19, size: 288, align: 32, elements: !2, templateParams: !99)
!99 = !{!100}
!100 = !DITemplateTypeParameter(name: "element", type: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleVertex", file: !52, line: 51, size: 288, align: 32, elements: !102)
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !101, file: !52, line: 53, baseType: !16, size: 96, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !101, file: !52, line: 54, baseType: !4, size: 128, align: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !101, file: !52, line: 55, baseType: !8, size: 32, align: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "TextureID", scope: !101, file: !52, line: 56, baseType: !87, size: 32, align: 32, offset: 256)
!107 = !DIGlobalVariable(name: "g_VertexCount", linkageName: "\01?g_VertexCount@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 20, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 20, size: 32, align: 32, elements: !2)
!109 = !DIGlobalVariable(name: "g_LargeBinParticles", linkageName: "\01?g_LargeBinParticles@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 21, type: !110, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 21, size: 32, align: 32, elements: !2, templateParams: !111)
!111 = !{!38}
!112 = !DIGlobalVariable(name: "g_LargeBinCounters", linkageName: "\01?g_LargeBinCounters@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 22, type: !113, isLocal: false, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 22, size: 32, align: 32, elements: !2)
!114 = !DIGlobalVariable(name: "g_VisibleParticles", linkageName: "\01?g_VisibleParticles@@3V?$RWStructuredBuffer@UParticleScreenData@@@@A", scope: !0, file: !1, line: 23, type: !115, isLocal: false, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ParticleScreenData>", file: !1, line: 23, size: 384, align: 32, elements: !2, templateParams: !116)
!116 = !{!117}
!117 = !DITemplateTypeParameter(name: "element", type: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleScreenData", file: !52, line: 60, size: 384, align: 32, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125, !126}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Corner", scope: !118, file: !52, line: 62, baseType: !24, size: 64, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "RcpSize", scope: !118, file: !52, line: 63, baseType: !24, size: 64, align: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !118, file: !52, line: 64, baseType: !4, size: 128, align: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !118, file: !52, line: 65, baseType: !8, size: 32, align: 32, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "TextureIndex", scope: !118, file: !52, line: 66, baseType: !8, size: 32, align: 32, offset: 288)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "TextureLevel", scope: !118, file: !52, line: 67, baseType: !8, size: 32, align: 32, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Bounds", scope: !118, file: !52, line: 68, baseType: !87, size: 32, align: 32, offset: 352)
!127 = !{i32 2, !"Dwarf Version", i32 4}
!128 = !{i32 2, !"Debug Info Version", i32 3}
!129 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
