#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: b74ec2dd9bc77c0ceb7d0670db237f71.pdb
; shader hash: b74ec2dd9bc77c0ceb7d0670db237f71
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer EmissionProperties
; {
;
;   struct EmissionProperties
;   {
;
;       float3 LastEmitPosW;                          ; Offset:    0
;       float EmitSpeed;                              ; Offset:   12
;       float3 EmitPosW;                              ; Offset:   16
;       float FloorHeight;                            ; Offset:   28
;       float3 EmitDirW;                              ; Offset:   32
;       float Restitution;                            ; Offset:   44
;       float3 EmitRightW;                            ; Offset:   48
;       float EmitterVelocitySensitivity;             ; Offset:   60
;       float3 EmitUpW;                               ; Offset:   64
;       uint MaxParticles;                            ; Offset:   76
;       float3 Gravity;                               ; Offset:   80
;       uint TextureID;                               ; Offset:   92

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !28)
!1 = !DIFile(filename: "Shaders\5CParticleUpdateCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 17, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 17, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16}
!16 = !DISubprogram(name: "main", scope: !1, file: !1, line: 30, type: !17, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 20, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 20, size: 96, align: 32, elements: !21, templateParams: !26)
!21 = !{!22, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !1, line: 20, baseType: !23, size: 32, align: 32, flags: DIFlagPublic)
!23 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !1, line: 20, baseType: !23, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !20, file: !1, line: 20, baseType: !23, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!26 = !{!27, !13}
!27 = !DITemplateTypeParameter(name: "element", type: !23)
!28 = !{!29, !32, !34, !35, !36, !37, !38, !39, !40, !41, !44, !45, !46, !47, !48, !62, !87, !88, !89, !90, !91, !92, !101, !102, !103, !104, !105, !106, !107, !109, !110, !111, !135, !147, !157}
!29 = !DIGlobalVariable(name: "LastEmitPosW", linkageName: "\01?LastEmitPosW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !30, line: 17, type: !31, isLocal: false, isDefinition: true)
!30 = !DIFile(filename: "Shaders/ParticleUpdateCommon.hlsli", directory: "")
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!32 = !DIGlobalVariable(name: "EmitSpeed", linkageName: "\01?EmitSpeed@EmissionProperties@@3MB", scope: !0, file: !30, line: 18, type: !33, isLocal: false, isDefinition: true)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!34 = !DIGlobalVariable(name: "EmitPosW", linkageName: "\01?EmitPosW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !30, line: 19, type: !31, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariable(name: "FloorHeight", linkageName: "\01?FloorHeight@EmissionProperties@@3MB", scope: !0, file: !30, line: 20, type: !33, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariable(name: "EmitDirW", linkageName: "\01?EmitDirW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !30, line: 21, type: !31, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariable(name: "Restitution", linkageName: "\01?Restitution@EmissionProperties@@3MB", scope: !0, file: !30, line: 22, type: !33, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariable(name: "EmitRightW", linkageName: "\01?EmitRightW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !30, line: 23, type: !31, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariable(name: "EmitterVelocitySensitivity", linkageName: "\01?EmitterVelocitySensitivity@EmissionProperties@@3MB", scope: !0, file: !30, line: 24, type: !33, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariable(name: "EmitUpW", linkageName: "\01?EmitUpW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !30, line: 25, type: !31, isLocal: false, isDefinition: true)
!41 = !DIGlobalVariable(name: "MaxParticles", linkageName: "\01?MaxParticles@EmissionProperties@@3IB", scope: !0, file: !30, line: 26, type: !42, isLocal: false, isDefinition: true)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !23)
!44 = !DIGlobalVariable(name: "Gravity", linkageName: "\01?Gravity@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !30, line: 27, type: !31, isLocal: false, isDefinition: true)
!45 = !DIGlobalVariable(name: "TextureID", linkageName: "\01?TextureID@EmissionProperties@@3IB", scope: !0, file: !30, line: 28, type: !42, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariable(name: "EmissiveColor", linkageName: "\01?EmissiveColor@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !30, line: 29, type: !31, isLocal: false, isDefinition: true)
!47 = !DIGlobalVariable(name: "pad", linkageName: "\01?pad@EmissionProperties@@3MB", scope: !0, file: !30, line: 30, type: !33, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariable(name: "RandIndex", linkageName: "\01?RandIndex@EmissionProperties@@3QBV?$vector@I$03@@B", scope: !0, file: !30, line: 31, type: !49, isLocal: false, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8192, align: 32, elements: !60)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 31, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 31, size: 128, align: 32, elements: !53, templateParams: !58)
!53 = !{!54, !55, !56, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !52, file: !1, line: 31, baseType: !23, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !52, file: !1, line: 31, baseType: !23, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !52, file: !1, line: 31, baseType: !23, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !52, file: !1, line: 31, baseType: !23, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!58 = !{!27, !59}
!59 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!60 = !{!61}
!61 = !DISubrange(count: 64)
!62 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !63, line: 34, type: !64, isLocal: false, isDefinition: true)
!63 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !67, templateParams: !84)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !66, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!84 = !{!12, !85, !86}
!85 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!86 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!87 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !63, line: 35, type: !64, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !63, line: 37, type: !33, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !63, line: 38, type: !33, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !63, line: 39, type: !33, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !63, line: 40, type: !33, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !63, line: 42, type: !93, isLocal: false, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !96, templateParams: !99)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !95, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !95, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!99 = !{!12, !100}
!100 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!101 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !63, line: 43, type: !93, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !63, line: 45, type: !42, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !63, line: 46, type: !42, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !63, line: 47, type: !42, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !63, line: 48, type: !42, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "gElapsedTime", linkageName: "\01?gElapsedTime@CB0@@3MB", scope: !0, file: !1, line: 20, type: !33, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !63, line: 28, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!109 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !63, line: 29, type: !108, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !63, line: 30, type: !108, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "g_ResetData", linkageName: "\01?g_ResetData@@3V?$StructuredBuffer@UParticleSpawnData@@@@A", scope: !0, file: !1, line: 23, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ParticleSpawnData>", file: !1, line: 23, size: 640, align: 32, elements: !2, templateParams: !113)
!113 = !{!114}
!114 = !DITemplateTypeParameter(name: "element", type: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleSpawnData", file: !30, line: 34, size: 640, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !134}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "AgeRate", scope: !115, file: !30, line: 36, baseType: !8, size: 32, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "RotationSpeed", scope: !115, file: !30, line: 37, baseType: !8, size: 32, align: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "StartSize", scope: !115, file: !30, line: 38, baseType: !8, size: 32, align: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "EndSize", scope: !115, file: !30, line: 39, baseType: !8, size: 32, align: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Velocity", scope: !115, file: !30, line: 40, baseType: !4, size: 96, align: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Mass", scope: !115, file: !30, line: 41, baseType: !8, size: 32, align: 32, offset: 224)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "SpreadOffset", scope: !115, file: !30, line: 42, baseType: !4, size: 96, align: 32, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Random", scope: !115, file: !30, line: 43, baseType: !8, size: 32, align: 32, offset: 352)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "StartColor", scope: !115, file: !30, line: 44, baseType: !126, size: 128, align: 32, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 36, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 36, size: 128, align: 32, elements: !128, templateParams: !133)
!128 = !{!129, !130, !131, !132}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !127, file: !1, line: 36, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !127, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !127, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !127, file: !1, line: 36, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!133 = !{!12, !59}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "EndColor", scope: !115, file: !30, line: 45, baseType: !126, size: 128, align: 32, offset: 512)
!135 = !DIGlobalVariable(name: "g_InputBuffer", linkageName: "\01?g_InputBuffer@@3V?$StructuredBuffer@UParticleMotion@@@@A", scope: !0, file: !1, line: 24, type: !136, isLocal: false, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ParticleMotion>", file: !1, line: 24, size: 320, align: 32, elements: !2, templateParams: !137)
!137 = !{!138}
!138 = !DITemplateTypeParameter(name: "element", type: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleMotion", file: !30, line: 48, size: 320, align: 32, elements: !140)
!140 = !{!141, !142, !143, !144, !145, !146}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !139, file: !30, line: 50, baseType: !4, size: 96, align: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Mass", scope: !139, file: !30, line: 51, baseType: !8, size: 32, align: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Velocity", scope: !139, file: !30, line: 52, baseType: !4, size: 96, align: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Age", scope: !139, file: !30, line: 53, baseType: !8, size: 32, align: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Rotation", scope: !139, file: !30, line: 54, baseType: !8, size: 32, align: 32, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ResetDataIndex", scope: !139, file: !30, line: 55, baseType: !43, size: 32, align: 32, offset: 288)
!147 = !DIGlobalVariable(name: "g_VertexBuffer", linkageName: "\01?g_VertexBuffer@@3V?$RWStructuredBuffer@UParticleVertex@@@@A", scope: !0, file: !1, line: 25, type: !148, isLocal: false, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ParticleVertex>", file: !1, line: 25, size: 288, align: 32, elements: !2, templateParams: !149)
!149 = !{!150}
!150 = !DITemplateTypeParameter(name: "element", type: !151)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleVertex", file: !63, line: 51, size: 288, align: 32, elements: !152)
!152 = !{!153, !154, !155, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !151, file: !63, line: 53, baseType: !4, size: 96, align: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !151, file: !63, line: 54, baseType: !126, size: 128, align: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !151, file: !63, line: 55, baseType: !8, size: 32, align: 32, offset: 224)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "TextureID", scope: !151, file: !63, line: 56, baseType: !43, size: 32, align: 32, offset: 256)
!157 = !DIGlobalVariable(name: "g_OutputBuffer", linkageName: "\01?g_OutputBuffer@@3V?$RWStructuredBuffer@UParticleMotion@@@@A", scope: !0, file: !1, line: 26, type: !158, isLocal: false, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ParticleMotion>", file: !1, line: 26, size: 320, align: 32, elements: !2, templateParams: !137)
!159 = !{i32 2, !"Dwarf Version", i32 4}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
