#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 8450763f26b39d4e8c78347ad32ba53e.pdb
; shader hash: 8450763f26b39d4e8c78347ad32ba53e
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CBChangesPerView
; {
;
;   struct hostlayout.CBChangesPerView
;   {
;
;       column_major float4x4 gInvView;               ; Offset:    0
;       column_major float4x4 gViewProj;              ; Offset:   64
;       float gVertCotangent;                         ; Offset:  128
;       float gAspectRatio;                           ; Offset:  132
;       float gRcpFarZ;                               ; Offset:  136
;       float gInvertZ;                               ; Offset:  140
;       float2 gBufferDim;                            ; Offset:  144
;       float2 gRcpBufferDim;                         ; Offset:  152
;       uint gBinsPerRow;                             ; Offset:  160
;       uint gTileRowPitch;                           ; Offset:  164
;       uint gTilesPerRow;                            ; Offset:  168
;       uint gTilesPerCol;                            ; Offset:  172
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !114)
!1 = !DIFile(filename: "Shaders\5CParticleTileRenderFastLowResCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 204, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 204, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 204, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 204, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 51, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 51, size: 96, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 51, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 51, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 51, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !18)
!23 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!24 = !{!25, !37, !62, !92, !96, !101, !104, !107, !111}
!25 = !DISubprogram(name: "main", scope: !26, file: !26, line: 201, type: !27, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!26 = !DIFile(filename: "Shaders/ParticleTileRenderCS.hlsl", directory: "")
!27 = !DISubroutineType(types: !28)
!28 = !{null, !29, !36, !29}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 26, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 26, size: 96, align: 32, elements: !31, templateParams: !35)
!31 = !{!32, !33, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !30, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !{!11, !23}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !8)
!37 = !DISubprogram(name: "RenderParticles", linkageName: "\01?RenderParticles@@YA?AV?$matrix@M$03$03@@V?$vector@I$01@@0III@Z", scope: !26, file: !26, line: 119, type: !38, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !4, !4, !36, !36, !36}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !42, templateParams: !59)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !41, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!59 = !{!22, !60, !61}
!60 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!61 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!62 = !DISubprogram(name: "BlendLowRes", linkageName: "\01?BlendLowRes@@YAXAIAV?$matrix@M$03$03@@UParticleScreenData@@V?$vector@M$01@@V?$vector@M$03@@@Z", scope: !26, file: !26, line: 87, type: !63, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65, !67, !71, !79}
!65 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !40)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleScreenData", file: !68, line: 60, size: 384, align: 32, elements: !69)
!68 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!69 = !{!70, !77, !78, !88, !89, !90, !91}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Corner", scope: !67, file: !68, line: 62, baseType: !71, size: 64, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !73, templateParams: !76)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !72, file: !1, line: 42, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !72, file: !1, line: 42, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!76 = !{!22, !12}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "RcpSize", scope: !67, file: !68, line: 63, baseType: !71, size: 64, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !67, file: !68, line: 64, baseType: !79, size: 128, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 35, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 35, size: 128, align: 32, elements: !81, templateParams: !86)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !80, file: !1, line: 35, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !80, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !80, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !80, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!86 = !{!22, !87}
!87 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !67, file: !68, line: 65, baseType: !18, size: 32, align: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "TextureIndex", scope: !67, file: !68, line: 66, baseType: !18, size: 32, align: 32, offset: 288)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "TextureLevel", scope: !67, file: !68, line: 67, baseType: !18, size: 32, align: 32, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Bounds", scope: !67, file: !68, line: 68, baseType: !36, size: 32, align: 32, offset: 352)
!92 = !DISubprogram(name: "SampleParticleColor", linkageName: "\01?SampleParticleColor@@YA?AV?$vector@M$03@@UParticleScreenData@@USamplerState@@V?$vector@M$01@@M@Z", scope: !26, file: !26, line: 47, type: !93, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!93 = !DISubroutineType(types: !94)
!94 = !{!79, !67, !95, !71, !18}
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!96 = !DISubprogram(name: "BlendPixel", linkageName: "\01?BlendPixel@@YAXAIAV?$vector@M$03@@V1@M@Z", scope: !26, file: !26, line: 59, type: !97, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !99, !79, !18}
!99 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !79)
!101 = !DISubprogram(name: "WriteBlendedQuad", linkageName: "\01?WriteBlendedQuad@@YAXV?$vector@I$01@@V?$matrix@M$03$03@@@Z", scope: !26, file: !26, line: 111, type: !102, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !4, !40}
!104 = !DISubprogram(name: "WriteBlendedColor", linkageName: "\01?WriteBlendedColor@@YAXV?$vector@I$01@@V?$vector@M$03@@@Z", scope: !26, file: !26, line: 100, type: !105, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !4, !79}
!107 = !DISubprogram(name: "Unpack_R11G11B10_FLOAT", linkageName: "\01?Unpack_R11G11B10_FLOAT@@YA?AV?$vector@M$02@@I@Z", scope: !108, file: !108, line: 31, type: !109, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false)
!108 = !DIFile(filename: "Shaders/PixelPacking_R11G11B10.hlsli", directory: "")
!109 = !DISubroutineType(types: !110)
!110 = !{!14, !36}
!111 = !DISubprogram(name: "Pack_R11G11B10_FLOAT", linkageName: "\01?Pack_R11G11B10_FLOAT@@YAIV?$vector@M$02@@@Z", scope: !108, file: !108, line: 20, type: !112, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false)
!112 = !DISubroutineType(types: !113)
!113 = !{!36, !14}
!114 = !{!115, !117, !118, !120, !121, !122, !123, !125, !126, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !140, !144, !146, !150, !152, !153}
!115 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !68, line: 34, type: !116, isLocal: false, isDefinition: true)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!117 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !68, line: 35, type: !116, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !68, line: 37, type: !119, isLocal: false, isDefinition: true)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!120 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !68, line: 38, type: !119, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !68, line: 39, type: !119, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !68, line: 40, type: !119, isLocal: false, isDefinition: true)
