#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: a488195a888655d1590ca142286da0db.pdb
; shader hash: a488195a888655d1590ca142286da0db
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; ColorTex                          texture     f32          2d      T0             t0     1
;
;
; ViewId state:
;
; Number of inputs: 4, outputs: 3
; Outputs dependent on ViewId: {  }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !13, globals: !48)
!1 = !DIFile(filename: "Shaders\5CPresentSDRPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 22, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 22, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !{!14, !36, !40, !44, !45, !46, !47}
!14 = !DISubprogram(name: "main", scope: !1, file: !1, line: 20, type: !15, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !27}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !19, templateParams: !24)
!19 = !{!20, !22, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !1, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!21 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !18, file: !1, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !18, file: !1, baseType: !21, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!24 = !{!25, !26}
!25 = !DITemplateTypeParameter(name: "element", type: !21)
!26 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !29, templateParams: !34)
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !28, file: !1, baseType: !21, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !28, file: !1, baseType: !21, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!34 = !{!25, !35}
!35 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!36 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !37, file: !37, line: 94, type: !38, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!37 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!38 = !DISubroutineType(types: !39)
!39 = !{!17, !17, !8}
!40 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !41, file: !41, line: 37, type: !42, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!41 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!17, !17}
!44 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !37, file: !37, line: 71, type: !42, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !41, file: !41, line: 63, type: !42, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !41, file: !41, line: 75, type: !42, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !41, file: !41, line: 120, type: !42, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!48 = !{!49, !53}
!49 = !DIGlobalVariable(name: "ColorTex", linkageName: "\01?ColorTex@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 17, type: !50, isLocal: false, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 17, size: 128, align: 32, elements: !2, templateParams: !51)
!51 = !{!52}
!52 = !DITemplateTypeParameter(name: "element", type: !18)
!53 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !47, file: !41, line: 122, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 122, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 122, size: 288, align: 32, elements: !57, templateParams: !67)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !56, file: !1, line: 122, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !56, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !56, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !56, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !56, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !56, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !56, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !56, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !56, file: !1, line: 122, baseType: !21, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!67 = !{!25, !68, !69}
!68 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 3)
!69 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 3)
!70 = !{i32 2, !"Dwarf Version", i32 4}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!73 = !{!"Shaders\5CPresentSDRPS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#include \22ShaderUtility.hlsli\22\0D\0A#include \22PresentRS.hlsli\22\0D\0A\0D\0ATexture2D<float3> ColorTex : register(t0);\0D\0A\0D\0A[RootSignature(Present_RootSig)]\0D\0Afloat3 main( float4 position : SV_Position ) : SV_Target0\0D\0A{\0D\0A    float3 LinearRGB = ColorTex[(int2)position.xy];\0D\0A    return ApplyDisplayProfile(LinearRGB, DISPLAY_PLANE_FORMAT);\0D\0A}\0D\0A"}
