#if 0
;
; Note: shader requires additional functionality:
;       Typed UAV Load Additional Formats
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 5a277104e9800a5b642670e41c1cfd4d.pdb
; shader hash: 5a277104e9800a5b642670e41c1cfd4d
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float2 g_RcpBufferDim;                        ; Offset:    0
;       float g_BloomStrength;                        ; Offset:    8
;       float PaperWhiteRatio;                        ; Offset:   12
;       float MaxBrightness;                          ; Offset:   16
;   
;   } CB0;                                            ; Offset:    0 Size:    20
;
; }
;
; Resource bind info for Exposure
; {
;
;   float $Element;                                   ; Offset:    0 Size:     4
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CB0                               cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !48)
!1 = !DIFile(filename: "Shaders\5CToneMapHDR2CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 45, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 45, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 45, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 45, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 45, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16, !29, !33, !36, !38, !42, !45}
!16 = !DISubprogram(name: "main", scope: !17, file: !17, line: 39, type: !18, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!17 = !DIFile(filename: "Shaders/ToneMapCS.hlsl", directory: "")
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 34, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 34, size: 96, align: 32, elements: !22, templateParams: !27)
!22 = !{!23, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, line: 34, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, line: 34, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !21, file: !1, line: 34, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !{!28, !13}
!28 = !DITemplateTypeParameter(name: "element", type: !24)
!29 = !DISubprogram(name: "TM_Stanard", linkageName: "\01?TM_Stanard@@YA?AV?$vector@M$02@@V1@@Z", scope: !30, file: !30, line: 71, type: !31, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!30 = !DIFile(filename: "Shaders/ToneMappingUtility.hlsli", directory: "")
!31 = !DISubroutineType(types: !32)
!32 = !{!4, !4}
!33 = !DISubprogram(name: "TM_Reinhard", linkageName: "\01?TM_Reinhard@@YA?AV?$vector@M$02@@V1@M@Z", scope: !30, file: !30, line: 25, type: !34, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false)
!34 = !DISubroutineType(types: !35)
!35 = !{!4, !4, !8}
!36 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !37, file: !37, line: 120, type: !31, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!37 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!38 = !DISubprogram(name: "RGBToLogLuminance", linkageName: "\01?RGBToLogLuminance@@YAMV?$vector@M$02@@M@Z", scope: !39, file: !39, line: 42, type: !40, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!40 = !DISubroutineType(types: !41)
!41 = !{!8, !4, !8}
!42 = !DISubprogram(name: "LinearToLogLuminance", linkageName: "\01?LinearToLogLuminance@@YAMMM@Z", scope: !39, file: !39, line: 23, type: !43, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!8, !8, !8}
!45 = !DISubprogram(name: "RGBToLuminance", linkageName: "\01?RGBToLuminance@@YAMV?$vector@M$02@@@Z", scope: !39, file: !39, line: 30, type: !46, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!8, !4}
!48 = !{!49, !58, !60, !61, !62, !65, !69, !71, !73, !75}
!49 = !DIGlobalVariable(name: "g_RcpBufferDim", linkageName: "\01?g_RcpBufferDim@CB0@@3V?$vector@M$01@@B", scope: !0, file: !17, line: 31, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 31, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !53, templateParams: !56)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !52, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !52, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !{!12, !57}
!57 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!58 = !DIGlobalVariable(name: "g_BloomStrength", linkageName: "\01?g_BloomStrength@CB0@@3MB", scope: !0, file: !17, line: 32, type: !59, isLocal: false, isDefinition: true)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!60 = !DIGlobalVariable(name: "PaperWhiteRatio", linkageName: "\01?PaperWhiteRatio@CB0@@3MB", scope: !0, file: !17, line: 33, type: !59, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariable(name: "MaxBrightness", linkageName: "\01?MaxBrightness@CB0@@3MB", scope: !0, file: !17, line: 34, type: !59, isLocal: false, isDefinition: true)
!62 = !DIGlobalVariable(name: "Exposure", linkageName: "\01?Exposure@@3V?$StructuredBuffer@M@@A", scope: !0, file: !17, line: 18, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<float>", file: !1, line: 18, size: 32, align: 32, elements: !2, templateParams: !64)
!64 = !{!12}
!65 = !DIGlobalVariable(name: "Bloom", linkageName: "\01?Bloom@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !17, line: 19, type: !66, isLocal: false, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 19, size: 128, align: 32, elements: !2, templateParams: !67)
!67 = !{!68}
!68 = !DITemplateTypeParameter(name: "element", type: !5)
!69 = !DIGlobalVariable(name: "ColorRW", linkageName: "\01?ColorRW@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !17, line: 21, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 3> >", file: !1, line: 21, size: 96, align: 32, elements: !2, templateParams: !67)
!71 = !DIGlobalVariable(name: "OutLuma", linkageName: "\01?OutLuma@@3V?$RWTexture2D@M@@A", scope: !0, file: !17, line: 26, type: !72, isLocal: false, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !64)
!73 = !DIGlobalVariable(name: "LinearSampler", linkageName: "\01?LinearSampler@@3USamplerState@@A", scope: !0, file: !17, line: 27, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 27, size: 32, align: 32, elements: !2)
!75 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !36, file: !37, line: 122, type: !76, isLocal: false, isDefinition: true)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 122, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 122, size: 288, align: 32, elements: !79, templateParams: !89)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !78, file: !1, line: 122, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !78, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !78, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !78, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !78, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !78, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !78, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !78, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !78, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!89 = !{!12, !90, !91}
!90 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!91 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!92 = !{i32 2, !"Dwarf Version", i32 4}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!95 = !{!"Shaders\5CToneMapHDR2CS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#define ENABLE_HDR_DISPLAY_MAPPING 1\0D\0A#define SUPPORT_TYPED_UAV_LOADS 1\0D\0A#include \22ToneMapCS.hlsl\22\0D\0A"}
