#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xy  
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 1     zw        2     NONE   float     zw
; TEXCOORD                 2   xyz         3     NONE   float   xyz 
; TEXCOORD                 3   xyz         4     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 8579ef728d8645d07e266c320d41ea5c.pdb
; shader hash: 8579ef728d8645d07e266c320d41ea5c
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
; TEXCOORD                 1                 linear       
; TEXCOORD                 2                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !25, globals: !78)
!1 = !DIFile(filename: "Shaders\5CDefaultNoTangentPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 281, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 281, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 281, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 281, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 35, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 35, size: 128, align: 32, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 35, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!25 = !{!26, !52, !55, !68, !71, !74, !75}
!26 = !DISubprogram(name: "main", scope: !27, file: !27, line: 243, type: !28, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!27 = !DIFile(filename: "Shaders/DefaultPS.hlsl", directory: "")
!28 = !DISubroutineType(types: !29)
!29 = !{!14, !30}
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !27, line: 54, size: 544, align: 32, elements: !31)
!31 = !{!32, !33, !42, !49, !50, !51}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !30, file: !27, line: 56, baseType: !14, size: 128, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !30, file: !27, line: 57, baseType: !34, size: 96, align: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 36, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 36, size: 96, align: 32, elements: !36, templateParams: !40)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 36, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 36, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !35, file: !1, line: 36, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !{!23, !41}
!41 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "uv0", scope: !30, file: !27, line: 61, baseType: !43, size: 64, align: 32, offset: 224)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 38, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 38, size: 64, align: 32, elements: !45, templateParams: !48)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !44, file: !1, line: 38, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !44, file: !1, line: 38, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!48 = !{!23, !12}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "uv1", scope: !30, file: !27, line: 63, baseType: !43, size: 64, align: 32, offset: 288)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "worldPos", scope: !30, file: !27, line: 65, baseType: !34, size: 96, align: 32, offset: 352)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "sunShadowCoord", scope: !30, file: !27, line: 66, baseType: !34, size: 96, align: 32, offset: 448)
!52 = !DISubprogram(name: "ComputeNormal", linkageName: "\01?ComputeNormal@@YA?AV?$vector@M$02@@UVSOutput@@@Z", scope: !27, file: !27, line: 219, type: !53, isLocal: false, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!34, !30}
!55 = !DISubprogram(name: "Diffuse_IBL", linkageName: "\01?Diffuse_IBL@@YA?AV?$vector@M$02@@USurfaceProperties@@@Z", scope: !27, file: !27, line: 198, type: !56, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!34, !58}
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "SurfaceProperties", file: !27, line: 85, size: 512, align: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !58, file: !27, line: 87, baseType: !34, size: 96, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !58, file: !27, line: 88, baseType: !34, size: 96, align: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "c_diff", scope: !58, file: !27, line: 89, baseType: !34, size: 96, align: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "c_spec", scope: !58, file: !27, line: 90, baseType: !34, size: 96, align: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !58, file: !27, line: 91, baseType: !18, size: 32, align: 32, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !58, file: !27, line: 92, baseType: !18, size: 32, align: 32, offset: 416)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "alphaSqr", scope: !58, file: !27, line: 93, baseType: !18, size: 32, align: 32, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "NdotV", scope: !58, file: !27, line: 94, baseType: !18, size: 32, align: 32, offset: 480)
!68 = !DISubprogram(name: "Fresnel_Shlick", linkageName: "\01?Fresnel_Shlick@@YAMMMM@Z", scope: !27, file: !27, line: 121, type: !69, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!18, !18, !18, !18}
!71 = !DISubprogram(name: "Pow5", linkageName: "\01?Pow5@@YAMM@Z", scope: !27, file: !27, line: 109, type: !72, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!18, !18}
!74 = !DISubprogram(name: "Specular_IBL", linkageName: "\01?Specular_IBL@@YA?AV?$vector@M$02@@USurfaceProperties@@@Z", scope: !27, file: !27, line: 212, type: !56, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubprogram(name: "Fresnel_Shlick", linkageName: "\01?Fresnel_Shlick@@YA?AV?$vector@M$02@@V1@0M@Z", scope: !27, file: !27, line: 116, type: !76, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!34, !34, !34, !18}
!78 = !{!79, !81, !83, !85, !87, !90, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !128, !130, !131, !135, !139, !148, !149, !150, !151, !152, !153, !154, !155, !157, !158, !161, !162, !163, !164, !165, !166, !167, !168, !169, !171, !173}
!79 = !DIGlobalVariable(name: "baseColorFactor", linkageName: "\01?baseColorFactor@MaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !27, line: 35, type: !80, isLocal: false, isDefinition: true)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!81 = !DIGlobalVariable(name: "emissiveFactor", linkageName: "\01?emissiveFactor@MaterialConstants@@3V?$vector@M$02@@B", scope: !0, file: !27, line: 36, type: !82, isLocal: false, isDefinition: true)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!83 = !DIGlobalVariable(name: "normalTextureScale", linkageName: "\01?normalTextureScale@MaterialConstants@@3MB", scope: !0, file: !27, line: 37, type: !84, isLocal: false, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!85 = !DIGlobalVariable(name: "metallicRoughnessFactor", linkageName: "\01?metallicRoughnessFactor@MaterialConstants@@3V?$vector@M$01@@B", scope: !0, file: !27, line: 38, type: !86, isLocal: false, isDefinition: true)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!87 = !DIGlobalVariable(name: "flags", linkageName: "\01?flags@MaterialConstants@@3IB", scope: !0, file: !27, line: 39, type: !88, isLocal: false, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 39, baseType: !8)
!90 = !DIGlobalVariable(name: "ViewProj", linkageName: "\01?ViewProj@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !27, line: 44, type: !91, isLocal: false, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 44, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 44, size: 512, align: 32, elements: !94, templateParams: !111)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !93, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!111 = !{!23, !112, !113}
!112 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!113 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!114 = !DIGlobalVariable(name: "SunShadowMatrix", linkageName: "\01?SunShadowMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !27, line: 45, type: !91, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariable(name: "ViewerPos", linkageName: "\01?ViewerPos@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !27, line: 46, type: !82, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariable(name: "SunDirection", linkageName: "\01?SunDirection@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !27, line: 47, type: !82, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariable(name: "SunIntensity", linkageName: "\01?SunIntensity@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !27, line: 48, type: !82, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "_pad", linkageName: "\01?_pad@GlobalConstants@@3MB", scope: !0, file: !27, line: 49, type: !84, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariable(name: "IBLRange", linkageName: "\01?IBLRange@GlobalConstants@@3MB", scope: !0, file: !27, line: 50, type: !84, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariable(name: "IBLBias", linkageName: "\01?IBLBias@GlobalConstants@@3MB", scope: !0, file: !27, line: 51, type: !84, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "BASECOLOR", scope: !0, file: !27, line: 74, type: !88, isLocal: true, isDefinition: true, variable: i32 0)
!122 = !DIGlobalVariable(name: "METALLICROUGHNESS", scope: !0, file: !27, line: 75, type: !88, isLocal: true, isDefinition: true, variable: i32 1)
!123 = !DIGlobalVariable(name: "OCCLUSION", scope: !0, file: !27, line: 76, type: !88, isLocal: true, isDefinition: true, variable: i32 2)
!124 = !DIGlobalVariable(name: "EMISSIVE", scope: !0, file: !27, line: 77, type: !88, isLocal: true, isDefinition: true, variable: i32 3)
!125 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !126, line: 41, type: !127, isLocal: false, isDefinition: true)
!126 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!128 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !126, line: 42, type: !129, isLocal: false, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!130 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !126, line: 43, type: !127, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariable(name: "baseColorTexture", linkageName: "\01?baseColorTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !27, line: 16, type: !132, isLocal: false, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 16, size: 160, align: 32, elements: !2, templateParams: !133)
!133 = !{!134}
!134 = !DITemplateTypeParameter(name: "element", type: !15)
!135 = !DIGlobalVariable(name: "metallicRoughnessTexture", linkageName: "\01?metallicRoughnessTexture@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !27, line: 17, type: !136, isLocal: false, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 17, size: 128, align: 32, elements: !2, templateParams: !137)
!137 = !{!138}
!138 = !DITemplateTypeParameter(name: "element", type: !35)
!139 = !DIGlobalVariable(name: "occlusionTexture", linkageName: "\01?occlusionTexture@@3V?$Texture2D@V?$vector@M$00@@@@A", scope: !0, file: !27, line: 18, type: !140, isLocal: false, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 1> >", file: !1, line: 18, size: 64, align: 32, elements: !2, templateParams: !141)
!141 = !{!142}
!142 = !DITemplateTypeParameter(name: "element", type: !143)
!143 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 1>", file: !1, line: 18, size: 32, align: 32, elements: !144, templateParams: !146)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !143, file: !1, line: 18, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!146 = !{!23, !147}
!147 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 1)
!148 = !DIGlobalVariable(name: "emissiveTexture", linkageName: "\01?emissiveTexture@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !27, line: 19, type: !136, isLocal: false, isDefinition: true)
!149 = !DIGlobalVariable(name: "normalTexture", linkageName: "\01?normalTexture@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !27, line: 20, type: !136, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariable(name: "baseColorSampler", linkageName: "\01?baseColorSampler@@3USamplerState@@A", scope: !0, file: !27, line: 22, type: !127, isLocal: false, isDefinition: true)
!151 = !DIGlobalVariable(name: "metallicRoughnessSampler", linkageName: "\01?metallicRoughnessSampler@@3USamplerState@@A", scope: !0, file: !27, line: 23, type: !127, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariable(name: "occlusionSampler", linkageName: "\01?occlusionSampler@@3USamplerState@@A", scope: !0, file: !27, line: 24, type: !127, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariable(name: "emissiveSampler", linkageName: "\01?emissiveSampler@@3USamplerState@@A", scope: !0, file: !27, line: 25, type: !127, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariable(name: "normalSampler", linkageName: "\01?normalSampler@@3USamplerState@@A", scope: !0, file: !27, line: 26, type: !127, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariable(name: "radianceIBLTexture", linkageName: "\01?radianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A", scope: !0, file: !27, line: 28, type: !156, isLocal: false, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 3> >", file: !1, line: 28, size: 96, align: 32, elements: !2, templateParams: !137)
!157 = !DIGlobalVariable(name: "irradianceIBLTexture", linkageName: "\01?irradianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A", scope: !0, file: !27, line: 29, type: !156, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariable(name: "texSSAO", linkageName: "\01?texSSAO@@3V?$Texture2D@M@@A", scope: !0, file: !27, line: 30, type: !159, isLocal: false, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 30, size: 64, align: 32, elements: !2, templateParams: !160)
!160 = !{!23}
!161 = !DIGlobalVariable(name: "texSunShadow", linkageName: "\01?texSunShadow@@3V?$Texture2D@M@@A", scope: !0, file: !27, line: 31, type: !159, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariable(name: "PI", scope: !0, file: !27, line: 70, type: !84, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !27, line: 71, type: !82, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariable(name: "BASECOLOR", scope: !0, file: !27, line: 74, type: !88, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariable(name: "METALLICROUGHNESS", scope: !0, file: !27, line: 75, type: !88, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariable(name: "OCCLUSION", scope: !0, file: !27, line: 76, type: !88, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariable(name: "EMISSIVE", scope: !0, file: !27, line: 77, type: !88, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariable(name: "NORMAL", scope: !0, file: !27, line: 78, type: !88, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariable(name: "kDielectricSpecular.1", linkageName: "kDielectricSpecular.1", scope: !0, file: !27, line: 71, type: !170, isLocal: false, isDefinition: true)
!170 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !82, size: 32, align: 4, offset: 32)
!171 = !DIGlobalVariable(name: "kDielectricSpecular.0", linkageName: "kDielectricSpecular.0", scope: !0, file: !27, line: 71, type: !172, isLocal: false, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !82, size: 32, align: 4)
!173 = !DIGlobalVariable(name: "kDielectricSpecular.2", linkageName: "kDielectricSpecular.2", scope: !0, file: !27, line: 71, type: !174, isLocal: false, isDefinition: true)
!174 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !82, size: 32, align: 4, offset: 64)
!175 = !{i32 2, !"Dwarf Version", i32 4}
!176 = !{i32 2, !"Debug Info Version", i32 3}
!177 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!178 = !{!"Shaders\5CDefaultNoTangentPS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):  James Stanard\0D\0A//\0D\0A\0D\0A#define NO_TANGENT_FRAME 1\0D\0A#include \22DefaultPS.hlsl\22"}
!179 = !{!"Shaders\5CCommon.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard \0A//\0A\0A#ifndef __COMMON_HLSLI__\0A#define __COMMON_HLSLI__\0A\0A// outdated warning about for-loop variable scope\0A#pragma warning (disable: 3078)\0A// single-iteration loop\0A#pragma warning (disable: 3557)\0A\0A#define Renderer_RootSig \5C\0A    \22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0A    \22DescriptorTable(SRV(t0, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22DescriptorTable(Sampler(s0, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22DescriptorTable(SRV(t10, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22CBV(b1), \22 \5C\0A    \22SRV(t20, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0A    \22StaticSampler(s10, maxAnisotropy = 8, visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22StaticSampler(s11, visibility = SHADER_VISIBILITY_PIXEL,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22comparisonFunc = COMPARISON_GREATER_EQUAL,\22 \5C\0A        \22filter = FILTER_MIN_MAG_LINEAR_MIP_POINT),\22 \5C\0A    \22StaticSampler(s12, maxAnisotropy = 8, visibility = SHADER_VISIBILITY_PIXEL)\22\0A\0A// Common (static) samplers\0ASamplerState defaultSampler : register(s10);\0ASamplerComparisonState shadowSampler : register(s11);\0ASamplerState cubeMapSampler : register(s12);\0A\0A#ifndef ENABLE_TRIANGLE_ID\0A    #define ENABLE_TRIANGLE_ID 0\0A#endif\0A\0A#if ENABLE_TRIANGLE_ID\0A\0Auint HashTriangleID(uint vertexID)\0A{\0A\09// TBD SM6.1 stuff\0A\09uint Index0 = EvaluateAttributeAtVertex(vertexID, 0);\0A\09uint Index1 = EvaluateAttributeAtVertex(vertexID, 1);\0A\09uint Index2 = EvaluateAttributeAtVertex(vertexID, 2);\0A\0A\09// When triangles are clipped (to the near plane?) their interpolants can sometimes\0A\09// be reordered.  To stabilize the ID generation, we need to sort the indices before\0A\09// forming the hash.\0A\09uint I0 = __XB_Min3_U32(Index0, Index1, Index2);\0A\09uint I1 = __XB_Med3_U32(Index0, Index1, Index2);\0A\09uint I2 = __XB_Max3_U32(Index0, Index1, Index2);\0A\09return (I2 & 0xFF) << 16 | (I1 & 0xFF) << 8 | (I0 & 0xFF0000FF);\0A}\0A\0A#endif // ENABLE_TRIANGLE_ID\0A\0A#endif // __COMMON_HLSLI__\0A"}
