#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TANGENT                  0   xyzw        2     NONE   float   xyzw
; TEXCOORD                 0   xy          3     NONE   float   xy  
; TEXCOORD                 1   xy          4     NONE   float   xy  
; BLENDINDICES             0   xyzw        5     NONE    uint   xyzw
; BLENDWEIGHT              0   xyzw        6     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TANGENT                  0   xyzw        2     NONE   float   xyzw
; TEXCOORD                 0   xy          3     NONE   float   xy  
; TEXCOORD                 1     zw        3     NONE   float     zw
; TEXCOORD                 2   xyz         4     NONE   float   xyz 
; TEXCOORD                 3   xyz         5     NONE   float   xyz 
;
; shader debug name: d3eaa80876f465d120027ac1c29f8763.pdb
; shader hash: d3eaa80876f465d120027ac1c29f8763
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !64)
!1 = !DIFile(filename: "Shaders\5CDefaultSkinVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 32, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 32, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !18, file: !18, line: 78, type: !19, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DIFile(filename: "Shaders/DefaultVS.hlsl", directory: "")
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !45}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !18, line: 62, size: 672, align: 32, elements: !22)
!22 = !{!23, !24, !33, !34, !42, !43, !44}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !21, file: !18, line: 64, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !21, file: !18, line: 65, baseType: !25, size: 96, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 30, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 30, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 30, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !21, file: !18, line: 67, baseType: !4, size: 128, align: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "uv0", scope: !21, file: !18, line: 69, baseType: !35, size: 64, align: 32, offset: 352)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 32, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 32, size: 64, align: 32, elements: !37, templateParams: !40)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !{!13, !41}
!41 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "uv1", scope: !21, file: !18, line: 71, baseType: !35, size: 64, align: 32, offset: 416)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "worldPos", scope: !21, file: !18, line: 73, baseType: !25, size: 96, align: 32, offset: 480)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "sunShadowCoord", scope: !21, file: !18, line: 74, baseType: !25, size: 96, align: 32, offset: 576)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !18, line: 45, size: 704, align: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !63}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !45, file: !18, line: 47, baseType: !25, size: 96, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !45, file: !18, line: 48, baseType: !25, size: 96, align: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !45, file: !18, line: 50, baseType: !4, size: 128, align: 32, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "uv0", scope: !45, file: !18, line: 52, baseType: !35, size: 64, align: 32, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "uv1", scope: !45, file: !18, line: 54, baseType: !35, size: 64, align: 32, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "jointIndices", scope: !45, file: !18, line: 57, baseType: !53, size: 128, align: 32, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 32, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 32, size: 128, align: 32, elements: !55, templateParams: !61)
!55 = !{!56, !58, !59, !60}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !54, file: !1, line: 32, baseType: !57, size: 32, align: 32, flags: DIFlagPublic)
!57 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !54, file: !1, line: 32, baseType: !57, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !54, file: !1, line: 32, baseType: !57, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !54, file: !1, line: 32, baseType: !57, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!61 = !{!62, !14}
!62 = !DITemplateTypeParameter(name: "element", type: !57)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "jointWeights", scope: !45, file: !18, line: 58, baseType: !4, size: 128, align: 32, offset: 576)
!64 = !{!65, !89, !106, !107, !108, !110, !111, !112, !115, !117, !118}
!65 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@MeshConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 22, type: !66, isLocal: false, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 22, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 22, size: 512, align: 32, elements: !69, templateParams: !86)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!86 = !{!13, !87, !88}
!87 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!88 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!89 = !DIGlobalVariable(name: "WorldIT", linkageName: "\01?WorldIT@MeshConstants@@3V?$matrix@M$02$02@@B", scope: !0, file: !18, line: 23, type: !90, isLocal: false, isDefinition: true)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 23, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 23, size: 288, align: 32, elements: !93, templateParams: !103)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !92, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !92, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !92, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !92, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !92, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !92, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !92, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !92, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !92, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!103 = !{!13, !104, !105}
!104 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!105 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!106 = !DIGlobalVariable(name: "ViewProjMatrix", linkageName: "\01?ViewProjMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 28, type: !66, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "SunShadowMatrix", linkageName: "\01?SunShadowMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 29, type: !66, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "ViewerPos", linkageName: "\01?ViewerPos@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !18, line: 30, type: !109, isLocal: false, isDefinition: true)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!110 = !DIGlobalVariable(name: "SunDirection", linkageName: "\01?SunDirection@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !18, line: 31, type: !109, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "SunIntensity", linkageName: "\01?SunIntensity@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !18, line: 32, type: !109, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !113, line: 41, type: !114, isLocal: false, isDefinition: true)
!113 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!115 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !113, line: 42, type: !116, isLocal: false, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!117 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !113, line: 43, type: !114, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "Joints", linkageName: "\01?Joints@@3V?$StructuredBuffer@UJoint@@@@A", scope: !0, file: !18, line: 42, type: !119, isLocal: false, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Joint>", file: !1, line: 42, size: 896, align: 32, elements: !2, templateParams: !120)
!120 = !{!121}
!121 = !DITemplateTypeParameter(name: "element", type: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Joint", file: !18, line: 36, size: 896, align: 32, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "PosMatrix", scope: !122, file: !18, line: 38, baseType: !67, size: 512, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "NrmMatrix", scope: !122, file: !18, line: 39, baseType: !126, size: 384, align: 32, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 100, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 100, size: 384, align: 32, elements: !128, templateParams: !141)
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !127, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!141 = !{!13, !87, !105}
!142 = !{i32 2, !"Dwarf Version", i32 4}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!145 = !{!"Shaders\5CDefaultSkinVS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):  James Stanard\0D\0A//\0D\0A\0D\0A#define ENABLE_SKINNING\0D\0A#include \22DefaultVS.hlsl\22"}
!146 = !{!"Shaders\5CCommon.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard \0A//\0A\0A#ifndef __COMMON_HLSLI__\0A#define __COMMON_HLSLI__\0A\0A// outdated warning about for-loop variable scope\0A#pragma warning (disable: 3078)\0A// single-iteration loop\0A#pragma warning (disable: 3557)\0A\0A#define Renderer_RootSig \5C\0A    \22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0A    \22DescriptorTable(SRV(t0, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22DescriptorTable(Sampler(s0, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22DescriptorTable(SRV(t10, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22CBV(b1), \22 \5C\0A    \22SRV(t20, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0A    \22StaticSampler(s10, maxAnisotropy = 8, visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22StaticSampler(s11, visibility = SHADER_VISIBILITY_PIXEL,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22comparisonFunc = COMPARISON_GREATER_EQUAL,\22 \5C\0A        \22filter = FILTER_MIN_MAG_LINEAR_MIP_POINT),\22 \5C\0A    \22StaticSampler(s12, maxAnisotropy = 8, visibility = SHADER_VISIBILITY_PIXEL)\22\0A\0A// Common (static) samplers\0ASamplerState defaultSampler : register(s10);\0ASamplerComparisonState shadowSampler : register(s11);\0ASamplerState cubeMapSampler : register(s12);\0A\0A#ifndef ENABLE_TRIANGLE_ID\0A    #define ENABLE_TRIANGLE_ID 0\0A#endif\0A\0A#if ENABLE_TRIANGLE_ID\0A\0Auint HashTriangleID(uint vertexID)\0A{\0A\09// TBD SM6.1 stuff\0A\09uint Index0 = EvaluateAttributeAtVertex(vertexID, 0);\0A\09uint Index1 = EvaluateAttributeAtVertex(vertexID, 1);\0A\09uint Index2 = EvaluateAttributeAtVertex(vertexID, 2);\0A\0A\09// When triangles are clipped (to the near plane?) their interpolants can sometimes\0A\09// be reordered.  To stabilize the ID generation, we need to sort the indices before\0A\09// forming the hash.\0A\09uint I0 = __XB_Min3_U32(Index0, Index1, Index2);\0A\09uint I1 = __XB_Med3_U32(Index0, Index1, Index2);\0A\09uint I2 = __XB_Max3_U32(Index0, Index1, Index2);\0A\09return (I2 & 0xFF) << 16 | (I1 & 0xFF) << 8 | (I0 & 0xFF0000FF);\0A}\0A\0A#endif // ENABLE_TRIANGLE_ID\0A\0A#endif // __COMMON_HLSLI__\0A"}
