#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TANGENT                  0   xyzw        2     NONE   float   xyzw
; TEXCOORD                 0   xy          3     NONE   float   xy  
; TEXCOORD                 1   xy          4     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TANGENT                  0   xyzw        2     NONE   float   xyzw
; TEXCOORD                 0   xy          3     NONE   float   xy  
; TEXCOORD                 1     zw        3     NONE   float     zw
; TEXCOORD                 2   xyz         4     NONE   float   xyz 
; TEXCOORD                 3   xyz         5     NONE   float   xyz 
;
; shader debug name: 6afc60df5cd4b0146a33207728adc9e5.pdb
; shader hash: 6afc60df5cd4b0146a33207728adc9e5
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !51)
!1 = !DIFile(filename: "Shaders\5CDefaultVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 32, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 32, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 78, type: !18, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !44}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 62, size: 672, align: 32, elements: !21)
!21 = !{!22, !23, !32, !33, !41, !42, !43}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 64, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !20, file: !1, line: 65, baseType: !24, size: 96, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 30, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 30, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 30, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !20, file: !1, line: 67, baseType: !4, size: 128, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "uv0", scope: !20, file: !1, line: 69, baseType: !34, size: 64, align: 32, offset: 352)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 32, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 32, size: 64, align: 32, elements: !36, templateParams: !39)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !{!13, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "uv1", scope: !20, file: !1, line: 71, baseType: !34, size: 64, align: 32, offset: 416)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "worldPos", scope: !20, file: !1, line: 73, baseType: !24, size: 96, align: 32, offset: 480)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "sunShadowCoord", scope: !20, file: !1, line: 74, baseType: !24, size: 96, align: 32, offset: 576)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 45, size: 448, align: 32, elements: !45)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !44, file: !1, line: 47, baseType: !24, size: 96, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !44, file: !1, line: 48, baseType: !24, size: 96, align: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !44, file: !1, line: 50, baseType: !4, size: 128, align: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "uv0", scope: !44, file: !1, line: 52, baseType: !34, size: 64, align: 32, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "uv1", scope: !44, file: !1, line: 54, baseType: !34, size: 64, align: 32, offset: 384)
!51 = !{!52, !76, !93, !94, !95, !97, !98, !99, !102, !104}
!52 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@MeshConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 22, type: !53, isLocal: false, isDefinition: true)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 22, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 22, size: 512, align: 32, elements: !56, templateParams: !73)
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!73 = !{!13, !74, !75}
!74 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!75 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!76 = !DIGlobalVariable(name: "WorldIT", linkageName: "\01?WorldIT@MeshConstants@@3V?$matrix@M$02$02@@B", scope: !0, file: !1, line: 23, type: !77, isLocal: false, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 23, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 23, size: 288, align: 32, elements: !80, templateParams: !90)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !79, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !79, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !79, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !79, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !79, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !79, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !79, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !79, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !79, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!90 = !{!13, !91, !92}
!91 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!92 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!93 = !DIGlobalVariable(name: "ViewProjMatrix", linkageName: "\01?ViewProjMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 28, type: !53, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariable(name: "SunShadowMatrix", linkageName: "\01?SunShadowMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 29, type: !53, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariable(name: "ViewerPos", linkageName: "\01?ViewerPos@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 30, type: !96, isLocal: false, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!97 = !DIGlobalVariable(name: "SunDirection", linkageName: "\01?SunDirection@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 31, type: !96, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "SunIntensity", linkageName: "\01?SunIntensity@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 32, type: !96, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !100, line: 41, type: !101, isLocal: false, isDefinition: true)
!100 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!102 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !100, line: 42, type: !103, isLocal: false, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!104 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !100, line: 43, type: !101, isLocal: false, isDefinition: true)
!105 = !{i32 2, !"Dwarf Version", i32 4}
!106 = !{i32 2, !"Debug Info Version", i32 3}
!107 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
