#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; BLENDINDICES             0   xyzw        1     NONE    uint   xyzw
; BLENDWEIGHT              0   xyzw        2     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
;
; shader debug name: 10d210a97b3b45a07e5e53bab5c22916.pdb
; shader hash: 10d210a97b3b45a07e5e53bab5c22916
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; BLENDINDICES             0                              
; BLENDWEIGHT              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
;
; Buffer Definitions:
;
; cbuffer MeshConstants
; {
;
;   struct hostlayout.MeshConstants
;   {
;
;       column_major float4x4 WorldMatrix;            ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !47)
!1 = !DIFile(filename: "Shaders\5CDepthOnlySkinVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 28, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 28, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !18, file: !18, line: 62, type: !19, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DIFile(filename: "Shaders/DepthOnlyVS.hlsl", directory: "")
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !24}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !18, line: 53, size: 128, align: 32, elements: !22)
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !21, file: !18, line: 55, baseType: !4, size: 128, align: 32)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !18, line: 41, size: 352, align: 32, elements: !25)
!25 = !{!26, !35, !46}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !24, file: !18, line: 43, baseType: !27, size: 96, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 28, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 28, size: 96, align: 32, elements: !29, templateParams: !33)
!29 = !{!30, !31, !32}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !28, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!33 = !{!13, !34}
!34 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "jointIndices", scope: !24, file: !18, line: 48, baseType: !36, size: 128, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 28, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 28, size: 128, align: 32, elements: !38, templateParams: !44)
!38 = !{!39, !41, !42, !43}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, line: 28, baseType: !40, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, line: 28, baseType: !40, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !37, file: !1, line: 28, baseType: !40, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !37, file: !1, line: 28, baseType: !40, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!44 = !{!45, !14}
!45 = !DITemplateTypeParameter(name: "element", type: !40)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "jointWeights", scope: !24, file: !18, line: 49, baseType: !4, size: 128, align: 32, offset: 224)
!47 = !{!48, !72, !89, !90, !93, !95, !96}
!48 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@MeshConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 22, type: !49, isLocal: false, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 22, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 22, size: 512, align: 32, elements: !52, templateParams: !69)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !51, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!69 = !{!13, !70, !71}
!70 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!71 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!72 = !DIGlobalVariable(name: "WorldIT", linkageName: "\01?WorldIT@MeshConstants@@3V?$matrix@M$02$02@@B", scope: !0, file: !18, line: 23, type: !73, isLocal: false, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 23, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 23, size: 288, align: 32, elements: !76, templateParams: !86)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !75, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !75, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !75, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !75, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !75, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !75, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !75, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !75, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !75, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!86 = !{!13, !87, !88}
!87 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!88 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!89 = !DIGlobalVariable(name: "ViewProjMatrix", linkageName: "\01?ViewProjMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 28, type: !49, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !91, line: 41, type: !92, isLocal: false, isDefinition: true)
!91 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!93 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !91, line: 42, type: !94, isLocal: false, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!95 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !91, line: 43, type: !92, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariable(name: "Joints", linkageName: "\01?Joints@@3V?$StructuredBuffer@UJoint@@@@A", scope: !0, file: !18, line: 38, type: !97, isLocal: false, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Joint>", file: !1, line: 38, size: 896, align: 32, elements: !2, templateParams: !98)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "element", type: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Joint", file: !18, line: 32, size: 896, align: 32, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "PosMatrix", scope: !100, file: !18, line: 34, baseType: !50, size: 512, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "NrmMatrix", scope: !100, file: !18, line: 35, baseType: !104, size: 384, align: 32, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 38, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 38, size: 384, align: 32, elements: !106, templateParams: !119)
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !105, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!119 = !{!13, !70, !88}
!120 = !{i32 2, !"Dwarf Version", i32 4}
!121 = !{i32 2, !"Debug Info Version", i32 3}
!122 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!123 = !{!"Shaders\5CDepthOnlySkinVS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):  James Stanard\0D\0A//\0D\0A\0D\0A#define ENABLE_SKINNING\0D\0A#include \22DepthOnlyVS.hlsl\22"}
!124 = !{!"Shaders\5CCommon.hlsli", !"//\0A// Copyright (c) Microsoft. All rights reserved.\0A// This code is licensed under the MIT License (MIT).\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0A//\0A// Developed by Minigraph\0A//\0A// Author:  James Stanard \0A//\0A\0A#ifndef __COMMON_HLSLI__\0A#define __COMMON_HLSLI__\0A\0A// outdated warning about for-loop variable scope\0A#pragma warning (disable: 3078)\0A// single-iteration loop\0A#pragma warning (disable: 3557)\0A\0A#define Renderer_RootSig \5C\0A    \22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0A    \22DescriptorTable(SRV(t0, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22DescriptorTable(Sampler(s0, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22DescriptorTable(SRV(t10, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22CBV(b1), \22 \5C\0A    \22SRV(t20, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0A    \22StaticSampler(s10, maxAnisotropy = 8, visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0A    \22StaticSampler(s11, visibility = SHADER_VISIBILITY_PIXEL,\22 \5C\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0A        \22comparisonFunc = COMPARISON_GREATER_EQUAL,\22 \5C\0A        \22filter = FILTER_MIN_MAG_LINEAR_MIP_POINT),\22 \5C\0A    \22StaticSampler(s12, maxAnisotropy = 8, visibility = SHADER_VISIBILITY_PIXEL)\22\0A\0A// Common (static) samplers\0ASamplerState defaultSampler : register(s10);\0ASamplerComparisonState shadowSampler : register(s11);\0ASamplerState cubeMapSampler : register(s12);\0A\0A#ifndef ENABLE_TRIANGLE_ID\0A    #define ENABLE_TRIANGLE_ID 0\0A#endif\0A\0A#if ENABLE_TRIANGLE_ID\0A\0Auint HashTriangleID(uint vertexID)\0A{\0A\09// TBD SM6.1 stuff\0A\09uint Index0 = EvaluateAttributeAtVertex(vertexID, 0);\0A\09uint Index1 = EvaluateAttributeAtVertex(vertexID, 1);\0A\09uint Index2 = EvaluateAttributeAtVertex(vertexID, 2);\0A\0A\09// When triangles are clipped (to the near plane?) their interpolants can sometimes\0A\09// be reordered.  To stabilize the ID generation, we need to sort the indices before\0A\09// forming the hash.\0A\09uint I0 = __XB_Min3_U32(Index0, Index1, Index2);\0A\09uint I1 = __XB_Med3_U32(Index0, Index1, Index2);\0A\09uint I2 = __XB_Max3_U32(Index0, Index1, Index2);\0A\09return (I2 & 0xFF) << 16 | (I1 & 0xFF) << 8 | (I0 & 0xFF0000FF);\0A}\0A\0A#endif // ENABLE_TRIANGLE_ID\0A\0A#endif // __COMMON_HLSLI__\0A"}
