#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TexCoord                 0   xy          1     NONE   float   xy  
;
; shader debug name: de96e0f9bc79f0cdf993429c953f46f5.pdb
; shader hash: de96e0f9bc79f0cdf993429c953f46f5
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Buffer Definitions:
;
; cbuffer VSConstants
; {
;
;   struct hostlayout.VSConstants
;   {
;
;       column_major float4x4 WVP;                    ; Offset:    0
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !43)
!1 = !DIFile(filename: "Shaders\5CDepthViewerVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 18, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 18, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 34, type: !18, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !31}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 27, size: 192, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !1, line: 29, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !1, line: 30, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 18, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 18, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 21, size: 160, align: 32, elements: !32)
!32 = !{!33, !42}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !31, file: !1, line: 23, baseType: !34, size: 96, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 18, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 18, size: 96, align: 32, elements: !36, templateParams: !40)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !35, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !{!13, !41}
!41 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !31, file: !1, line: 24, baseType: !24, size: 64, align: 32, offset: 96)
!43 = !{!44, !68, !71, !73}
!44 = !DIGlobalVariable(name: "WVP", linkageName: "\01?WVP@VSConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 18, type: !45, isLocal: false, isDefinition: true)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 18, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 18, size: 512, align: 32, elements: !48, templateParams: !65)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !47, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!65 = !{!13, !66, !67}
!66 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!67 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!68 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !69, line: 41, type: !70, isLocal: false, isDefinition: true)
!69 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!71 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !69, line: 42, type: !72, isLocal: false, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!73 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !69, line: 43, type: !70, isLocal: false, isDefinition: true)
!74 = !{i32 2, !"Dwarf Version", i32 4}
!75 = !{i32 2, !"Debug Info Version", i32 3}
!76 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!77 = !{!"Shaders\5CDepthViewerVS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):  James Stanard\0D\0A//\0D\0A\0D\0A#include \22Common.hlsli\22\0D\0A\0D\0Acbuffer VSConstants : register(b0)\0D\0A{\0D\0A    float4x4 WVP;\0D\0A};\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 pos : POSITION;\0D\0A    float2 uv : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4 pos : SV_Position;\0D\0A    float2 uv : TexCoord0;\0D\0A};\0D\0A\0D\0A[RootSignature(Renderer_RootSig)]\0D\0AVSOutput main(VSInput vsInput)\0D\0A{\0D\0A    VSOutput vsOutput;\0D\0A    vsOutput.pos = mul(WVP, float4(vsInput.pos, 1.0));\0D\0A    vsOutput.uv = vsInput.uv;\0D\0A    return vsOutput;\0D\0A}\0D\0A"}
