#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xy  
; WorldPos                 0   xyz         1     NONE   float   xyz 
; TexCoord                 0   xy          2     NONE   float   xy  
; TexCoord                 1   xyz         3     NONE   float   xyz 
; TexCoord                 2   xyz         4     NONE   float   xyz 
; Normal                   0   xyz         5     NONE   float   xyz 
; Tangent                  0   xyz         6     NONE   float   xyz 
; Bitangent                0   xyz         7     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
; SV_Target                1   xyz         1   TARGET   float   xyz 
;
; shader debug name: 761e9056d699cb3fc752f0dc3165f9b3.pdb
; shader hash: 761e9056d699cb3fc752f0dc3165f9b3
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0   noperspective sample       
; WorldPos                 0                 sample       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !54, globals: !145)
!1 = !DIFile(filename: "Shaders\5CModelViewerPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !31, !39, !45}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 48, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 48, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 63, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 63, size: 288, align: 32, elements: !16, templateParams: !27)
!16 = !{!17, !19, !20, !21, !22, !23, !24, !25, !26}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !15, file: !1, line: 63, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !15, file: !1, line: 63, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !15, file: !1, line: 63, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !15, file: !1, line: 63, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !15, file: !1, line: 63, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !15, file: !1, line: 63, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !15, file: !1, line: 63, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !15, file: !1, line: 63, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !15, file: !1, line: 63, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!27 = !{!28, !29, !30}
!28 = !DITemplateTypeParameter(name: "element", type: !18)
!29 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 21, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 21, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 21, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 21, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 21, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!28, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 30, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 30, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 30, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!28, !12}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 24, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 24, size: 128, align: 32, elements: !47, templateParams: !52)
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !46, file: !1, line: 24, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !46, file: !1, line: 24, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !46, file: !1, line: 24, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !46, file: !1, line: 24, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!52 = !{!28, !53}
!53 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!54 = !{!55, !72, !76, !83, !88, !91, !94, !97, !100, !104, !108, !111, !114, !117, !142}
!55 = !DISubprogram(name: "main", scope: !1, file: !1, line: 44, type: !56, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !62}
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "MRT", file: !1, line: 37, size: 192, align: 32, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !58, file: !1, line: 39, baseType: !31, size: 96, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !58, file: !1, line: 40, baseType: !31, size: 96, align: 32, offset: 96)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 25, size: 768, align: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !62, file: !1, line: 27, baseType: !45, size: 128, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "worldPos", scope: !62, file: !1, line: 28, baseType: !31, size: 96, align: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !62, file: !1, line: 29, baseType: !39, size: 64, align: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "viewDir", scope: !62, file: !1, line: 30, baseType: !31, size: 96, align: 32, offset: 288)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "shadowCoord", scope: !62, file: !1, line: 31, baseType: !31, size: 96, align: 32, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !62, file: !1, line: 32, baseType: !31, size: 96, align: 32, offset: 480)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !62, file: !1, line: 33, baseType: !31, size: 96, align: 32, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "bitangent", scope: !62, file: !1, line: 34, baseType: !31, size: 96, align: 32, offset: 672)
!72 = !DISubprogram(name: "ApplyAmbientLight", linkageName: "\01?ApplyAmbientLight@@YA?AV?$vector@M$02@@V1@M0@Z", scope: !73, file: !73, line: 56, type: !74, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DIFile(filename: "Shaders/Lighting.hlsli", directory: "")
!74 = !DISubroutineType(types: !75)
!75 = !{!31, !31, !18, !31}
!76 = !DISubprogram(name: "AntiAliasSpecular", linkageName: "\01?AntiAliasSpecular@@YAXAIAV?$vector@M$02@@AIAM@Z", scope: !73, file: !73, line: 38, type: !77, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !79, !81}
!79 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !31)
!81 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !18)
!83 = !DISubprogram(name: "ApplyDirectionalLight", linkageName: "\01?ApplyDirectionalLight@@YA?AV?$vector@M$02@@V1@0MM00000V?$Texture2D@M@@@Z", scope: !73, file: !73, line: 120, type: !84, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubroutineType(types: !85)
!85 = !{!31, !31, !31, !18, !18, !31, !31, !31, !31, !31, !86}
!86 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 22, size: 64, align: 32, elements: !2, templateParams: !87)
!87 = !{!28}
!88 = !DISubprogram(name: "GetDirectionalShadow", linkageName: "\01?GetDirectionalShadow@@YAMV?$vector@M$02@@V?$Texture2D@M@@@Z", scope: !73, file: !73, line: 65, type: !89, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{!18, !31, !86}
!91 = !DISubprogram(name: "ApplyLightCommon", linkageName: "\01?ApplyLightCommon@@YA?AV?$vector@M$02@@V1@0MM0000@Z", scope: !73, file: !73, line: 97, type: !92, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{!31, !31, !31, !18, !18, !31, !31, !31, !31}
!94 = !DISubprogram(name: "FSchlick", linkageName: "\01?FSchlick@@YAXAIAV?$vector@M$02@@0V1@1@Z", scope: !73, file: !73, line: 49, type: !95, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !79, !79, !31, !31}
!97 = !DISubprogram(name: "ShadeLights", linkageName: "\01?ShadeLights@@YAXAIAV?$vector@M$02@@V?$vector@I$01@@V1@2MM222@Z", scope: !73, file: !73, line: 315, type: !98, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !79, !4, !31, !31, !18, !18, !31, !31, !31}
!100 = !DISubprogram(name: "GetTilePos", linkageName: "\01?GetTilePos@@YA?AV?$vector@I$01@@V?$vector@M$01@@0@Z", scope: !101, file: !101, line: 32, type: !102, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false)
!101 = !DIFile(filename: "Shaders/LightGrid.hlsli", directory: "")
!102 = !DISubroutineType(types: !103)
!103 = !{!4, !39, !39}
!104 = !DISubprogram(name: "GetTileIndex", linkageName: "\01?GetTileIndex@@YAIV?$vector@I$01@@I@Z", scope: !101, file: !101, line: 36, type: !105, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !4, !107}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 30, baseType: !8)
!108 = !DISubprogram(name: "GetTileOffset", linkageName: "\01?GetTileOffset@@YAII@Z", scope: !101, file: !101, line: 40, type: !109, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!107, !107}
!111 = !DISubprogram(name: "ApplyPointLight", linkageName: "\01?ApplyPointLight@@YA?AV?$vector@M$02@@V1@0MM0000M0@Z", scope: !73, file: !73, line: 147, type: !112, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false)
!112 = !DISubroutineType(types: !113)
!113 = !{!31, !31, !31, !18, !18, !31, !31, !31, !31, !18, !31}
!114 = !DISubprogram(name: "ApplyConeLight", linkageName: "\01?ApplyConeLight@@YA?AV?$vector@M$02@@V1@0MM0000M00V?$vector@M$01@@@Z", scope: !73, file: !73, line: 182, type: !115, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false)
!115 = !DISubroutineType(types: !116)
!116 = !{!31, !31, !31, !18, !18, !31, !31, !31, !31, !18, !31, !31, !39}
!117 = !DISubprogram(name: "ApplyConeShadowedLight", linkageName: "\01?ApplyConeShadowedLight@@YA?AV?$vector@M$02@@V1@0MM0000M00V?$vector@M$01@@V?$matrix@M$03$03@@I@Z", scope: !73, file: !73, line: 222, type: !118, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: false)
!118 = !DISubroutineType(types: !119)
!119 = !{!31, !31, !31, !18, !18, !31, !31, !31, !31, !18, !31, !31, !39, !120, !107}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 33, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 33, size: 512, align: 32, elements: !122, templateParams: !139)
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !121, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!139 = !{!28, !140, !141}
!140 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!141 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!142 = !DISubprogram(name: "GetShadowConeLight", linkageName: "\01?GetShadowConeLight@@YAMIV?$vector@M$02@@@Z", scope: !73, file: !73, line: 90, type: !143, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false)
!143 = !DISubroutineType(types: !144)
!144 = !{!18, !107, !31}
!145 = !{!146, !148, !149, !150, !152, !153, !163, !164, !166, !169, !171, !172, !185, !187, !189, !190, !194, !195, !196, !197, !198}
!146 = !DIGlobalVariable(name: "SunDirection", linkageName: "\01?SunDirection@PSConstants@@3V?$vector@M$02@@B", scope: !0, file: !73, line: 21, type: !147, isLocal: false, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!148 = !DIGlobalVariable(name: "SunColor", linkageName: "\01?SunColor@PSConstants@@3V?$vector@M$02@@B", scope: !0, file: !73, line: 22, type: !147, isLocal: false, isDefinition: true)
!149 = !DIGlobalVariable(name: "AmbientColor", linkageName: "\01?AmbientColor@PSConstants@@3V?$vector@M$02@@B", scope: !0, file: !73, line: 23, type: !147, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariable(name: "ShadowTexelSize", linkageName: "\01?ShadowTexelSize@PSConstants@@3V?$vector@M$03@@B", scope: !0, file: !73, line: 24, type: !151, isLocal: false, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!152 = !DIGlobalVariable(name: "InvTileDim", linkageName: "\01?InvTileDim@PSConstants@@3V?$vector@M$03@@B", scope: !0, file: !73, line: 26, type: !151, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariable(name: "TileCount", linkageName: "\01?TileCount@PSConstants@@3V?$vector@I$03@@B", scope: !0, file: !73, line: 27, type: !154, isLocal: false, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 27, baseType: !156)
!156 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 27, size: 128, align: 32, elements: !157, templateParams: !162)
!157 = !{!158, !159, !160, !161}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !156, file: !1, line: 27, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !156, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !156, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !156, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!162 = !{!11, !53}
!163 = !DIGlobalVariable(name: "FirstLightIndex", linkageName: "\01?FirstLightIndex@PSConstants@@3V?$vector@I$03@@B", scope: !0, file: !73, line: 28, type: !154, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "FrameIndexMod2", linkageName: "\01?FrameIndexMod2@PSConstants@@3IB", scope: !0, file: !73, line: 30, type: !165, isLocal: false, isDefinition: true)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!166 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !167, line: 41, type: !168, isLocal: false, isDefinition: true)
!167 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!169 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !167, line: 42, type: !170, isLocal: false, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!171 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !167, line: 43, type: !168, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariable(name: "lightBuffer", linkageName: "\01?lightBuffer@@3V?$StructuredBuffer@ULightData@@@@A", scope: !0, file: !73, line: 33, type: !173, isLocal: false, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<LightData>", file: !1, line: 33, size: 928, align: 32, elements: !2, templateParams: !174)
!174 = !{!175}
!175 = !DITemplateTypeParameter(name: "element", type: !176)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !101, line: 18, size: 928, align: 32, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !176, file: !101, line: 20, baseType: !31, size: 96, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "radiusSq", scope: !176, file: !101, line: 21, baseType: !18, size: 32, align: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !176, file: !101, line: 23, baseType: !31, size: 96, align: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !101, line: 24, baseType: !107, size: 32, align: 32, offset: 224)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "coneDir", scope: !176, file: !101, line: 26, baseType: !31, size: 96, align: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "coneAngles", scope: !176, file: !101, line: 27, baseType: !39, size: 64, align: 32, offset: 352)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "shadowTextureMatrix", scope: !176, file: !101, line: 29, baseType: !120, size: 512, align: 32, offset: 416)
!185 = !DIGlobalVariable(name: "lightShadowArrayTex", linkageName: "\01?lightShadowArrayTex@@3V?$Texture2DArray@M@@A", scope: !0, file: !73, line: 34, type: !186, isLocal: false, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2DArray<float>", file: !1, line: 34, size: 64, align: 32, elements: !2, templateParams: !87)
!187 = !DIGlobalVariable(name: "lightGrid", linkageName: "\01?lightGrid@@3UByteAddressBuffer@@A", scope: !0, file: !73, line: 35, type: !188, isLocal: false, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 35, size: 32, align: 32, elements: !2)
!189 = !DIGlobalVariable(name: "lightGridBitMask", linkageName: "\01?lightGridBitMask@@3UByteAddressBuffer@@A", scope: !0, file: !73, line: 36, type: !188, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariable(name: "texDiffuse", linkageName: "\01?texDiffuse@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 16, type: !191, isLocal: false, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 16, size: 128, align: 32, elements: !2, templateParams: !192)
!192 = !{!193}
!193 = !DITemplateTypeParameter(name: "element", type: !32)
!194 = !DIGlobalVariable(name: "texSpecular", linkageName: "\01?texSpecular@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 17, type: !191, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariable(name: "texNormal", linkageName: "\01?texNormal@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 19, type: !191, isLocal: false, isDefinition: true)
!196 = !DIGlobalVariable(name: "texSSAO", linkageName: "\01?texSSAO@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 22, type: !86, isLocal: false, isDefinition: true)
!197 = !DIGlobalVariable(name: "texShadow", linkageName: "\01?texShadow@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 23, type: !86, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariable(name: "Dilation", scope: !88, file: !73, line: 70, type: !199, isLocal: true, isDefinition: true)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!200 = !{i32 2, !"Dwarf Version", i32 4}
!201 = !{i32 2, !"Debug Info Version", i32 3}
!202 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
